UPDATE `creature_template` SET `speed_walk`='2' WHERE entry in (71953,71952,71954,71955);
UPDATE `creature_template_addon` SET `auras`='144537' WHERE (`entry`='72016');

DELETE FROM creature_text WHERE Entry in (73303);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
('73303', '5', '0', 'Вам удалось пройти испытание мудрости и путь Нефритовой Змеи. Извлеките из них урок, как я когда-то.', '14', '0', '100', '0', '0', '38040', '75937', '0', '0', '0', '0'),
('73303', '1', '0', 'Вам удалось пройти испытание надежды и путь Красного Журавля. Да направит он ваши стопы.', '14', '0', '100', '0', '0', '38042', '75939', '0', '0', '0', '0'),
('73303', '3', '0', 'Вам удалось пройти испытание силы и путь Белого Тигра. Запомните этот урок навсегда.', '14', '0', '100', '0', '0', '38041', '75938', '0', '0', '0', '0'),
('73303', '7', '0', 'Вам удалось пройти испытание стойкости и путь Черного Быка. Да пребудет с вами его благословение!', '14', '0', '100', '0', '0', '38043', '75940', '0', '0', '0', '0'),
('73303', '4', '0', 'Давным-давно Нефритовая Змея сказала мне, что надо очистить дух и слиться с землей. Так я поборол сомнение.', '14', '0', '100', '0', '0', '38036', '75933', '0', '0', '0', '0'),
('73303', '0', '0', 'Красный Журавль увидел во мне надежду и велел заглянуть внутрь себя. Хоть я и чувствовал отчаяние, надежда помогла побороть его.', '14', '0', '100', '0', '0', '38038', '75935', '0', '0', '0', '0'),
('73303', '6', '0', 'Перед лицом великого страха Черный Бык учил меня стойкости. Так я превозмог ужас и тьму, и страх отступил.', '14', '0', '100', '0', '0', '38039', '75936', '0', '0', '0', '0'),
('73303', '2', '0', 'Я был силен, но безрассуден. Белый Тигр обучил меня управлять собой. Так я поборол ненависть, злобу и жестокость.', '14', '0', '100', '0', '0', '38037', '75934', '0', '0', '0', '0');
