  -- Дворец Могу'шан. 
DELETE FROM `creature_action` WHERE (`entry`='61945') AND (`target`='61945') AND (`type`='0');
UPDATE creature_template SET faction = 16 WHERE entry in (61945);
UPDATE `creature_template` SET `unit_flags`='0' WHERE (`entry`='64243');
UPDATE `creature_template` SET `flags_extra`='130' WHERE (`entry`='67231');
UPDATE `creature_template` SET `flags_extra`='128' WHERE (`entry`='61478');
UPDATE `creature_template` SET `flags_extra`='128' WHERE (`entry`='63093');
UPDATE `creature_template` SET `flags_extra`='128' WHERE (`entry`='61679');
UPDATE `creature_template` SET `flags_extra`='128' WHERE (`entry`='56911');
UPDATE `creature_template` SET `flags_extra`='130' WHERE (`entry`='63992');
UPDATE `creature_template_addon` SET `bytes1`='0' WHERE (`entry`='61453');
UPDATE `creature_text` SET `BroadcastTextID`='61067' WHERE (`Entry`='61442');
UPDATE `creature_text` SET `BroadcastTextID`='61077' WHERE (`Entry`='61442');
REPLACE INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
('61442', '5', '0', '|TInterface\\Icons\\spell_shaman_earthquake.blp:20|tКуай Бесчеловечный пускает |cFFFF0000|Hspell:119922|h[ударную волну]|h|r!', '41', '0', '100', '0', '0', '0', '65534', '0', '0', '0', '');
DELETE FROM `creature_text` WHERE (`Entry`='61450');
DELETE FROM `creature_text` WHERE (`Entry`='61447');

UPDATE `gameobject_template` SET `ScriptName`='go_setting_sun_brasier' WHERE (`entry`='214358');

UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='61679'); -- фризит карту.
DELETE FROM creature WHERE id = 59834;

 -- Осада храма Нюцзао
UPDATE `creature` SET `spawndist`='0' WHERE (`guid`='198167');

REPLACE INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
('13', '1', '120095', '0', '0', '31', '0', '3', '61613', '0', '0', '0', '', 'to target'),
('13', '1', '120001', '0', '0', '31', '0', '3', '61613', '0', '0', '0', '', 'to target'),
('13', '1', '124291', '0', '0', '31', '0', '3', '63720', '0', '0', '0', '', 'to target');

UPDATE `creature_template` SET `ScriptName`='npc_puddle' WHERE (`entry`='61613');
UPDATE `creature_template` SET `ScriptName`='npc_globue' WHERE (`entry`='61623');
UPDATE `creature_template` SET `ScriptName`='npc_pavalak_amber_sapper' WHERE (`entry`='61484');
UPDATE `creature_template` SET `ScriptName`='npc_pavalak_reinforcements_summoner' WHERE (`entry`='61483');

UPDATE `creature_template_wdb` SET `Displayid1`='0' WHERE (`Entry`='61613');
UPDATE `gameobject_template` SET `flags`='0' WHERE (`entry`='213174');
UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='61701');
UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='63106');
UPDATE `creature_template` SET `InhabitType`='4' WHERE (`entry`='61484');
DELETE FROM `creature_template_addon` WHERE (`entry`='64517');
UPDATE `creature_template` SET `mechanic_immune_mask`='277037054' WHERE (`entry`='62205');

UPDATE `creature` SET `position_x`='1527.774', `position_y`='5178.048', `position_z`='158.7578', `orientation`='4.762567' WHERE (`guid`='198167');

DELETE FROM spell_linked_spell WHERE spell_trigger = 119376;
INSERT INTO `spell_linked_spell` (`spell_trigger`, `spell_effect`, `type`, `caster`, `target`, `hastype`, `hastalent`, `hasparam`, `hastype2`, `hastalent2`, `hasparam2`, `chance`, `cooldown`, `duration`, `hitmask`, `removeMask`, `effectMask`, `targetCountType`, `targetCount`, `actiontype`, `group`, `param`, `randList`, `comment`) VALUES
('119376', '119377', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Бомбардировка'),
('119393', '-119386', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Осадный снаряд'),
('119393', '-119388', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Осадный снаряд');

REPLACE INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
('61567', '3', '0', '|cFFFE9A2EКапли смолы|r начинают выделяться из дерева!', '41', '0', '100', '0', '0', '0', '61182', '0', '0', '0', ''),
('61567', '4', '0', 'Allow me to show you the power of amber alchemy...', '14', '0', '100', '0', '0', '29395', '66448', '0', '0', '0', ''),
('61567', '5', '0', 'Your carved bones will decorate the weapons of our warriors!', '14', '0', '100', '0', '0', '29393', '66446', '0', '0', '0', ''),
('61567', '5', '1', 'Did you think you stood a chance?!', '14', '0', '100', '0', '0', '29394', '66447', '0', '0', '0', '');

DELETE FROM spell_script_names WHERE spell_id in (119941,120001,119512,119476,121447);
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES
('119941', 'spell_sap_residue'),
('120001', 'spell_jinbak_detonate'),
('119512', 'spell_pavalak_bombardment'),
('119476', 'spell_general_pavalak_bulwark'),
('121447', 'quick_dry_resin_after_effect');

DELETE FROM gameobject WHERE id in (213174);
INSERT INTO `gameobject` (`id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `AiID`) VALUES
(213174, 1011, 0, 0, 262, '', 1528.8, 5246.287, 188.2148, 1.539751, 0, 0, 0.9890159, -0.1478094, 7200, 255, 1, 0); -- 213174 (Area: -1)

DELETE FROM creature_template_spell WHERE entry in (61701);

DELETE FROM creature_text WHERE entry in (61620);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `comment`) VALUES
(61620, 0, 0, 'Спасибо, конечно, за спасение, но мы по-прежнему со всех сторон окружены богомолами.', 12, 0, 100, 0, 0, 31505, 61584, 'Ян Железный Коготь to Сик''тик-страж'),
(61620, 1, 0, 'Только посмотрите. Их слишком много. Мы не справимся.', 12, 0, 100, 0, 0, 31506, 61591, 'Ян Железный Коготь to Сик''тик-страж'),
(61620, 2, 0, 'Хм-м... У меня появилась идея. Это может сработать, но мне понадобится помощь!', 12, 0, 100, 0, 0, 31507, 62580, 'Ян Железный Коготь to Сик''тик-страж'),
(61620, 3, 0, 'Обратим оружие этих богомолов против них самих!', 12, 0, 100, 0, 0, 31508, 62581, 'Ян Железный Коготь to Сик''тик-страж'),
(61620, 4, 0, 'Ли! Ло! Нам нужен сок!', 12, 0, 100, 0, 0, 31509, 62582, 'Ян Железный Коготь to Player'),
(61620, 5, 0, 'Ну, начнем веселье?', 12, 0, 100, 0, 0, 31510, 62583, 'Ян Железный Коготь to Player'),
(61620, 6, 0, 'Мы раздавим вас, как жуков!', 14, 0, 100, 0, 0, 31514, 66224, 'Ян Железный Коготь to Player'),
(61620, 7, 0, 'Большой отряд |cFF00dc29сик''тиков-роевиков|r вступает в битву.', 41, 0, 100, 0, 0, 30265, 62318, 'Ян Железный Коготь to Player'),
(61620, 8, 0, 'Роевики взбираются по склону! Используй смолу, чтобы их замедлить!', 12, 0, 100, 0, 0, 31511, 62586, 'Ян Железный Коготь to Player'),
(61620, 9, 0, 'Желтокрыл приближается. Берегитесь!', 12, 0, 100, 0, 0, 31503, 62023, 'Ян Железный Коготь to Player'),
(61620, 10, 0, 'Большой отряд |cFFB600B8сик''тиков-разрушителей|r вступает в бой.', 41, 0, 100, 0, 0, 30266, 62578, 'Ян Железный Коготь to Player'),
(61620, 11, 0, 'У подрывников бомбы! Прямой – и они взлетят на воздух!', 12, 0, 100, 0, 0, 31504, 62025, 'Ян Железный Коготь to Player'),
(61620, 12, 0, 'Большой отряд |cFF00dc29сик''тиков-роевиков|r и |cFF815d18сик''тиков-воинов|r вступает в битву.', 41, 0, 100, 0, 0, 30267, 62622, 'Ян Железный Коготь to Player'),
(61620, 13, 0, 'Воин! Сосредоточьте огонь на нем!', 12, 0, 100, 0, 0, 31512, 62168, 'Ян Железный Коготь to Player'),
(61620, 14, 0, 'Большой отряд |cFFB600B8сик''тиков-разрушителей|r и |cFF815d18сик''тиков-воинов|r вступает в бой.', 41, 0, 100, 0, 0, 30268, 62623, 'Ян Железный Коготь to Player'),
(61620, 15, 0, 'По-моему, было весело!', 12, 0, 100, 0, 0, 31497, 62551, 'Ян Железный Коготь to Player'),
(61620, 16, 0, 'Ли, Ло! Спуститесь к нашим друзьям!', 12, 0, 100, 0, 0, 31498, 62734, 'Ян Железный Коготь to Player'),
(61620, 17, 0, 'Ворота заперты... но думаю, я смогу их открыть.', 12, 0, 100, 0, 0, 31499, 62735, 'Ян Железный Коготь to Player'),
(61620, 18, 0, 'Дайте-ка подумать... запал на 30 секунд...', 12, 0, 100, 0, 0, 31500, 62736, 'Ян Железный Коготь to Player'),
(61620, 19, 0, 'Что? Я сказал "тридцать?" Я имел в виду три!', 12, 0, 100, 0, 0, 31501, 62737, 'Ян Железный Коготь to Player'),
(61620, 20, 0, 'Быстрее! Вы должны остановить осаду!', 12, 0, 100, 0, 0, 31502, 62738, 'Ян Железный Коготь to Player');

 -- Хмеля
UPDATE `creature_text` SET `GroupID`='1', `MinTimer`='0', `MaxTimer`='0' WHERE (`Entry`='59075') AND (`Text`='Эй... эй, ТЫ! Это НАШИ... летающие... пивные монстры?');

DELETE FROM spell_script_names WHERE spell_id in (111666,114386,106851);
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES
('111666', 'spell_sb_smash'),
('114386', 'spell_carbonation'),
('106851', 'spell_blackout_brew');

DELETE FROM spell_target_position WHERE id in (114809);
INSERT INTO `spell_target_position` (`id`, `target_map`, `target_position_x`, `target_position_y`, `target_position_z`, `target_orientation`) VALUES
('114809', '961', '-749.505', '1325.9305', '146.7136', '1.88276');

DELETE FROM creature WHERE id in (59799,59510);
UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='59479');

DELETE FROM npc_spellclick_spells WHERE npc_entry in (59799);
INSERT INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES
('59799', '114459', '1', '0');

 -- Каменные недра
DELETE FROM `creature_template_spell` WHERE (`entry`='42428') AND (`spell`='213738');
DELETE FROM `creature_template_spell` WHERE (`entry`='42428') AND (`spell`='215377');
UPDATE `creature_template_addon` SET `bytes1`='0' WHERE (`entry`='42428');
UPDATE `creature_template` SET `IgnoreLos`='1' WHERE (`entry`='42333');

DELETE FROM creature_text WHERE entry in (42333);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
('42333', '3', '1', 'A sacrifice for you, master.', '14', '0', '100', '0', '0', '21635', '46254', '0', '0', '0', 'VO_SC_Azil aggro2'),
('42333', '2', '0', 'For my death, countless more will fall. The burden is now yours to bear.', '14', '0', '100', '0', '0', '21633', '46251', '0', '0', '0', 'VO_SC_Azil death'),
('42333', '3', '0', 'The world will be reborn in flames!', '14', '0', '100', '0', '0', '21634', '46255', '0', '0', '0', 'VO_SC_Azil aggro1'),
('42333', '1', '0', 'Witness the power bestowed upon me by Deathwing! Feel the fury of earth!', '14', '0', '100', '0', '0', '21628', '46253', '0', '0', '0', 'VO_SC_Azil spell01');

 -- Храм Нефритовой Змеи
UPDATE `creature` SET `dynamicflags`='64' WHERE id in (56873);
UPDATE `creature` SET `spawndist`='0', `MovementType`='0', `orientation`='1.1949' WHERE (`guid`='198706');
UPDATE `creature_template` SET `faction`='35' WHERE (`entry`='56843');
UPDATE creature_text SET Type = 14 WHERE Entry = 56843;
UPDATE `creature_template` SET `unit_flags`='32768' WHERE entry in (59726,59051);
UPDATE `creature_text` SET `GroupID`='0' WHERE (`Entry`='56872') AND (`Text`='Во имя предков!');
UPDATE `creature_template` SET `unit_flags`='16' WHERE (`entry`='56872');
UPDATE `creature_template` SET `speed_walk`='1', `speed_run`='1.142857' WHERE (`entry`='56843');
UPDATE `creature_text` SET `Sound`='30896', `BroadcastTextID`='57614' WHERE (`Entry`='56843') AND GroupID = 10;
UPDATE `creature_text` SET `Type`='14' WHERE (`Entry`='58826') AND GroupID = 0;
UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='56843');
DELETE FROM creature WHERE id = 56861;

REPLACE INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
('13', '1', '107048', '0', '0', '31', '0', '3', '56861', '0', '0', '0', '', 'to target'),
('13', '1', '107048', '0', '0', '31', '0', '3', '56843', '0', '0', '0', '', 'to target');

REPLACE INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
(56843, 15, 0, 'Как вы уже поняли, конфликты порождают вражду. Если в вашем сердце царит покой, вокруг вас не будет и раздоров.', 14, 0, 100, 1, 0, 30900, 57990, 0, 0, 0, 'Хранитель истории Каменная Поступь to Опасность'),
(56843, 16, 0, 'Спасибо вам, герои. Вы принесли покой этому священному храму.', 14, 0, 100, 1, 0, 30885, 57612, 0, 0, 0, 'Хранитель истории Каменная Поступь to Опасность'),
(56843, 17, 0, 'Теперь идите! Прежде чем начать ритуал восстановления, я должен помедитировать.', 14, 0, 100, 1, 0, 30886, 57613, 0, 0, 0, 'Хранитель истории Каменная Поступь to Опасность'),
(56843, 18, 0, 'Цзао был настоящим героем нашего народа. Горько, что его история осквернена ша, но вы сумели восстановить добрую память о нем.', 14, 0, 100, 1, 0, 30907, 57611, 0, 0, 0, 'Хранитель истории Каменная Поступь to Опасность'),
(58826, 1, 0, 'Я положу этому конец!', 14, 0, 100, 0, 0, 27747, 57748, 0, 0, 0, 'Цзао Искатель Солнца to Солнце');

DELETE FROM spell_target_filter WHERE spellId = 111853;
INSERT INTO `spell_target_filter` (`spellId`, `index`, `targetId`, `option`, `param1`, `param2`, `param3`, `aura`, `chance`, `effectMask`, `resizeType`, `count`, `maxcount`, `addcount`, `addcaster`, `comments`) VALUES
('111853', '0', '7', '0', '0', '0', '0', '0', '0', '1', '2', '1', '0', '0', '0', 'Вспышка солнечной ярости');

UPDATE `creature_text` SET `BroadcastTextID`='59470' WHERE (`Entry`='56448') AND (`Text`='Water reacts violently to your contact!');
UPDATE `creature_text` SET `BroadcastTextID`='55723' WHERE (`Entry`='56448') AND (`Text`='The waters whisper to me. Enemies approach.');
DELETE FROM `creature_text` WHERE (`Entry`='56448') AND (`Text`='Rise!');
UPDATE `creature_template` SET `IgnoreLos`='1' WHERE (`entry`='56448');
UPDATE creature_text SET type = 14 WHERE entry in (56732,56439);
UPDATE `creature_text` SET `BroadcastTextID`='62912' WHERE (`Entry`='56439') AND (`Text`='You cannot escape me. I am... in... every... breath...');

REPLACE INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
('13', '1', '106228', '0', '0', '31', '0', '4', '0', '0', '0', '0', '', 'to target');

 -- Монастырь Шадо Пан
DELETE FROM creature WHERE id = 59752; 
DELETE FROM creature WHERE guid = 198012; 
UPDATE `creature_template_wdb` SET `Displayid1`='0' WHERE (`Entry`='58812');

DELETE FROM creature WHERE id IN (56765,56763,56766);
INSERT INTO `creature` (`id`, `map`, `zoneId`, `areaId`, `spawnMask`, `phaseMask`, `PhaseId`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `npcflag2`, `unit_flags`, `dynamicflags`, `AiID`, `MovementID`, `MeleeID`, `isActive`, `skipClone`, `personal_size`, `unit_flags3`) VALUES
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3726.04', '3157.29', '813.184', '3.74486', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3697.48', '3171.27', '812.925', '1.24226', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3689.99', '3176.82', '813.064', '4.90606', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3735.89', '3170.16', '811.981', '0.799051', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3841.42', '3161.19', '795.521', '3.58345', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3812.12', '3161.69', '795.528', '2.61323', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3778.27', '3186.64', '809.452', '0.262741', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3731.76', '3203.15', '811.288', '4.29374', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3692.73', '3190.57', '813.985', '1.90074', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3869.19', '3136.98', '781.05', '6.07025', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3770.95', '3204.04', '806.024', '1.71713', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3721.71', '3213.8', '811.388', '4.39774', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3827.17', '3156.35', '795.525', '4.89346', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3778.12', '3211.46', '806.024', '0.109231', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3734.01', '3247.28', '807.613', '0.569577', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3837.3', '3174.55', '795.528', '4.25135', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3708.81', '3208.71', '811.919', '2.55364', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3829.21', '3173', '795.527', '4.37571', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3912.33', '3102.51', '776.359', '3.70539', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3823.34', '3230.9', '795.53', '2.40496', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3935.52', '3087.77', '776.36', '5.33897', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3837.69', '3219.53', '795.53', '0.606491', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3881.01', '3126.79', '775.094', '3.04357', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3936.27', '3055.96', '779.914', '5.89659', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3911.19', '3096.41', '776.355', '2.91154', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3908.95', '3098.35', '776.363', '3.11001', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3945.61', '3029.38', '780.863', '2.33921', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3939.84', '3077.19', '777.273', '4.49602', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '3928.73', '3079.51', '776.361', '3.39627', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56763', '959', '5918', '5918', '262', '1', '', '0', '0', '3820.42', '3226.5', '795.529', '4.8463', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3941.7', '3058.63', '779.218', '3.02511', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3963.7', '3039', '779.846', '2.67784', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3968.66', '3080.98', '781.588', '5.91917', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3977.33', '3068.81', '783.46', '2.8176', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3974.04', '2979.25', '780.009', '3.08513', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3977.72', '2980.79', '780.009', '4.94426', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3977.2', '2981.37', '780.009', '3.2526', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3978.87', '2981.36', '780.009', '5.90008', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3977.66', '2980.73', '780.009', '5.52205', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56766', '959', '5918', '5918', '262', '1', '', '0', '0', '3993.64', '3046.72', '782.479', '4.12592', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '4071.47', '2925.42', '780.009', '2.22701', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('56765', '959', '5918', '5918', '262', '1', '', '0', '0', '4074.36', '2926.38', '780.009', '0.938634', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0');

 -- Дворец Могу шан
UPDATE `creature_text` SET `GroupID`='0', `MinTimer`='0', `MaxTimer`='0' WHERE (`Entry`='64243') AND GroupID = 3;
UPDATE `creature_text` SET `BroadcastTextID`='63256' WHERE (`Entry`='61243') AND (`Text`='Such a waste...');
UPDATE `creature_text` SET `BroadcastTextID`='63255' WHERE (`Entry`='61243') AND (`Text`='Stop them!');
DELETE FROM creature WHERE guid in (199667,199669,199666,198646,198645);
UPDATE `creature_template` SET `mechanic_immune_mask`='617299711' WHERE (`entry`='61444');

DELETE FROM creature WHERE id in (61337,61338,61339,61340,61247);
INSERT INTO `creature` (`id`, `map`, `zoneId`, `areaId`, `spawnMask`, `phaseMask`, `PhaseId`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `npcflag2`, `unit_flags`, `dynamicflags`, `AiID`, `MovementID`, `MeleeID`, `isActive`, `skipClone`, `personal_size`) VALUES
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4377', '-2668.36', '-41.1689', '2.9755', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4374.87', '-2683.19', '-40.0479', '3.67696', '7200', '6', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4377.32', '-2671.16', '-41.1238', '3.31155', '7200', '3', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4451.73', '-2600.08', '-28.3239', '2.60168', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4452.53', '-2615.08', '-28.3264', '3.76831', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4451.93', '-2618.8', '-28.3269', '2.64729', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4377.32', '-2671.16', '-41.1238', '3.31155', '7200', '3', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4374.97', '-2688.26', '-39.2063', '3.69155', '7200', '6', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4442.75', '-2574.33', '-28.4101', '1.7734', '7200', '5', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4450.58', '-2596.26', '-28.3233', '3.50211', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4434.61', '-2566.59', '-28.3245', '3.23699', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4437.93', '-2570.29', '-28.3255', '2.20004', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4374.97', '-2688.26', '-39.2063', '3.69155', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4377', '-2668.36', '-41.1689', '2.9755', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4377', '-2668.36', '-41.1689', '2.9755', '7200', '5', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4369.74', '-2677.32', '-26.2822', '6.09354', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4343', '-2605.2', '-28.3247', '5.68859', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4343.12', '-2596.92', '-28.4067', '0.174326', '7200', '5', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4342.48', '-2616.68', '-28.4099', '1.27268', '7200', '5', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4352.69', '-2577.56', '-28.3272', '1.16232', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4368.41', '-2562.13', '-28.323', '0.419346', '7200', '6', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4343.13', '-2608.91', '-28.3253', '0.710397', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4364.73', '-2564.43', '-28.3237', '1.62157', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6472', '262', '1', '0', '0', '0', '-4331.23', '-2523.22', '-28.3238', '0.376011', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6472', '262', '1', '0', '0', '0', '-4331.48', '-2516.5', '-28.3238', '6.06011', '7200', '5', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4354.94', '-2574.27', '-28.3266', '6.23481', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61247', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4374.87', '-2683.19', '-40.0479', '3.67696', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61337', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4397.91', '-2595.86', '-54.5063', '0.141493', '7200', '6', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61338', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4416.07', '-2597.25', '-54.5063', '3.41857', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61339', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4374.46', '-2596.99', '-54.4638', '3.88481', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'),
('61340', '994', '6182', '6473', '262', '1', '0', '0', '0', '-4421.37', '-2595.37', '-54.4701', '5.5211', '7200', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0');