DELETE FROM gameobject WHERE id in (267657,267658);
INSERT INTO `gameobject` (`id`, `map`, `zoneId`, `areaId`, `spawnMask`, `PhaseId`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `state`, `AiID`) VALUES
(267657, 571, 0, 0, 1, '', 5265.317, -658.3073, 162.9778, 4.195059, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5246.618, -665.6667, 162.2145, 5.902955, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5269.51, -661.4774, 163.7512, 3.741448, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5247.108, -675.8055, 163.159, 0.5297154, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5267.413, -659.8264, 163.3131, 4.02836, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5245.497, -670.8785, 162.6328, 6.141293, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5245.809, -668.2483, 162.4471, 5.918432, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5248.358, -678.1858, 163.5075, 0.5181734, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5245.77, -673.4618, 162.8674, 0.1060217, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5262.967, -656.8698, 162.6357, 4.297147, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267657, 571, 0, 0, 1, '', 5270.958, -663.5851, 164.166, 3.790306, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 4554)
(267658, 571, 0, 0, 1, '', 5272.581, -666.033, 164.2694, 6.142658, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 4554)
(267658, 571, 0, 0, 1, '', 5247.791, -662.9531, 161.9609, 6.088565, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 4554)
(267657, 1, 0, 0, 1, '', -9525.217, -999.5764, 102.8739, 5.031856, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9511.453, -997.6476, 103.1816, 1.314743, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9508.92, -998.5504, 103.0956, 1.25257, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9522.692, -998.7153, 103.1413, 5.031856, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9526.734, -1018.818, 100.916, 3.974342, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9528.569, -1016.837, 100.9227, 3.912169, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9511.935, -1023.052, 102.3734, 1.85454, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9509.661, -1022.154, 102.7137, 2.088734, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9507.601, -1020.714, 102.9077, 2.251069, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9505.5, -1019.083, 102.9075, 2.222155, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267657, 1, 0, 0, 1, '', -9524.92, -1020.406, 100.906, 4.121516, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 5466)
(267658, 1, 0, 0, 1, '', -9520.143, -997.9445, 103.2851, 0, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 5466)
(267658, 1, 0, 0, 1, '', -9513.969, -997.0938, 103.2222, 0, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 5466)
(267658, 1, 0, 0, 1, '', -9514.478, -1023.634, 101.9249, 3.473487, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 5466)
(267658, 1, 0, 0, 1, '', -9522.771, -1021.865, 100.9156, 2.659593, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 5466)
(267657, 1220, 0, 0, 1, '', 480.5642, 6527.455, 36.9817, 3.700975, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 476.3004, 6530.821, 37.97899, 4.164922, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 474.0278, 6532.175, 38.59175, 4.214176, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 478.5139, 6529.281, 37.08323, 4.011065, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 483.5347, 6519.866, 37.14684, 2.989323, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 482.2222, 6525.28, 37.00673, 3.478119, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 483.2691, 6522.619, 37.00098, 3.188268, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7360)
(267658, 1220, 0, 0, 1, '', 483.4792, 6517.045, 37.20632, 4.682903, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7360)
(267657, 1220, 0, 0, 1, '', 1666.877, 4802.292, 139.3431, 4.294945, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1661.556, 4774.731, 138.2984, 1.465365, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1647.984, 4791.341, 138.3751, 6.017857, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1664.2, 4803.057, 139.1661, 4.434512, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1648.017, 4786.066, 138.9217, 0.1363322, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1661.488, 4803.241, 138.9467, 4.654794, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1656.313, 4802.124, 138.4424, 5.024713, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1648.927, 4783.585, 138.6578, 0.3551697, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1658.891, 4802.99, 138.6852, 4.796279, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1658.96, 4775.124, 138.3104, 1.237176, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1648.668, 4794.04, 138.3166, 5.773939, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 1647.773, 4788.693, 138.6917, 0, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7928)
(267658, 1220, 0, 0, 1, '', 1669.408, 4801.182, 139.5109, 0, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7928)
(267658, 1220, 0, 0, 1, '', 1650.007, 4796.287, 138.3129, 0, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7928)
(267658, 1220, 0, 0, 1, '', 1656.293, 4776.068, 138.3127, 0, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7928)
(267657, 1220, 0, 0, 1, '', 4504.94, 4844.11, 661.9739, 1.333273, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4492.499, 4853.069, 662.119, 0.2303016, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4520.699, 4834.374, 661.6483, 2.166483, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4492.013, 4855.682, 662.1172, 6.252804, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4510.155, 4844.538, 663.0573, 1.80934, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4507.596, 4844.017, 662.4358, 1.521186, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4512.424, 4845.64, 663.6331, 1.973709, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4516.479, 4848.354, 664.4427, 2.17682, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 4514.605, 4846.919, 664.0328, 2.127568, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267658, 1220, 0, 0, 1, '', 4502.238, 4844.655, 661.857, 3.294999, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7733)
(267658, 1220, 0, 0, 1, '', 4492.223, 4858.306, 662.0993, 1.290075, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3833.529, 2072.37, 260.2527, 5.117302, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3843.477, 2073.707, 257.6875, 4.322146, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3852.637, 2059.847, 250.439, 2.741468, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3831.367, 2070.83, 260.3242, 5.377989, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3850.016, 2070.276, 254.7608, 3.779139, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3845.865, 2072.978, 256.7644, 4.196676, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3848.078, 2071.682, 255.7485, 4.050403, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3850.661, 2055.382, 249.3934, 2.538356, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3851.82, 2057.628, 249.8752, 2.692215, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3840.881, 2074.231, 258.6222, 4.472277, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3849.036, 2053.253, 249.0723, 2.398437, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3835.853, 2073.394, 259.8901, 4.969948, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3829.459, 2069.155, 260.1297, 5.424238, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3838.274, 2074.111, 259.3813, 4.751121, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3847.198, 2051.399, 248.9, 2.110281, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3842.436, 2048.927, 249.1295, 1.709936, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267657, 1220, 0, 0, 1, '', 3844.934, 2050, 248.9544, 1.922368, 0, 0, 0, 1, 180, 255, 1, 0), -- 267657 (Area: 7733)
(267658, 1220, 0, 0, 1, '', 3851.441, 2068.161, 253.6604, 0.1065339, 0, 0, 0, 1, 180, 255, 1, 0), -- 267658 (Area: 7733)
(267658, 1220, 0, 0, 1, '', 3839.838, 2048.411, 249.4302, 0, 0, 0, 0, 1, 180, 255, 1, 0); -- 267658 (Area: 7733)

DELETE FROM  creature WHERE id in (118469,118470,118481,118482,118363,118467,118468,118466,118435,118436,118446,118442,118443);
INSERT INTO `creature` (`id`, `map`, `zoneId`, `areaId`, `spawnMask`, `phaseMask`, `PhaseId`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `unit_flags`, `dynamicflags`, `AiID`, `MovementID`, `MeleeID`) VALUES
(118469, 571, 0, 0, 1, 1, '', 0, 0, 5259.518, -668.8802, 163.2465, 4.431096, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118469 (Area: 4554)
(118470, 571, 0, 0, 1, 1, '', 0, 0, 5251.976, -668.9739, 162.6224, 2.016648, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118470 (Area: 4554)
(118481, 1, 0, 0, 1, 1, '', 0, 0, -9520.694, -1008.941, 102.2403, 0, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118481 (Area: 5466)
(118482, 1, 0, 0, 1, 1, '', 0, 0, -9515.857, -1006.686, 102.8409, 1.468917, 180, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0), -- 118482 (Area: 5466)
(118466, 1220, 0, 0, 1, 1, '', 0, 0, 471.0191, 6518.351, 39.03863, 3.025434, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118466 (Area: 7360)
(118467, 1220, 0, 0, 1, 1, '', 0, 0, 470.0799, 6523.107, 38.95201, 0.7212756, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118467 (Area: 7360)
(118468, 1220, 0, 0, 1, 1, '', 0, 0, 466.3403, 6522.457, 39.17054, 2.678031, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118468 (Area: 7360)
(118435, 1220, 0, 0, 1, 1, '', 0, 0, 1661.743, 4788.854, 138.8568, 0, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118435 (Area: 7840)
(118436, 1220, 0, 0, 1, 1, '', 0, 0, 1657.115, 4787.663, 138.9572, 2.263437, 180, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0), -- 118436 (Area: 7840)
(118446, 1220, 0, 0, 1, 1, '', 0, 0, 4506.38, 4856.669, 662.1934, 0, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118364 (Area: 8087)
(118442, 1220, 0, 0, 1, 1, '', 0, 0, 3842.556, 2065.042, 254.8965, 0, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118442 (Area: 7733)
(118443, 1220, 0, 0, 1, 1, '', 0, 0, 3843.473, 2059.955, 252.7483, 6.237277, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0), -- 118443 (Area: 7733)
(118473, 870, 0, 0, 1, 1, '', 0, 0, 547.6684, -653.8698, 257.4579, 0, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0); -- 118366 (Area: -1) (Auras: )

DELETE FROM creature_text WHERE Entry in (118354,118470,118297,118340,118482,118355,118474,118351,118352,118467,118357,118436,118353,118356,118443,94409);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `comment`) VALUES
(118354, 0, 0, 'Добро пожаловать на борт. Усаживайтесь поудобнее и наслаждайтесь прогулкой.', 12, 0, 100, 0, 0, 0, 126677, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 1, 0, 'Прямо под вами раскинулся Лес Хрустальной Песни.', 12, 0, 100, 0, 0, 0, 126678, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 2, 0, 'Мне довелось немало постранствовать по свету, но здесь, к сожалению, я провел куда меньше времени, чем мне бы хотелось...', 12, 0, 100, 0, 0, 0, 126679, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 3, 0, 'Нордскол... С этим местом у меня связаны приятные воспоминания.', 12, 0, 100, 0, 0, 0, 126680, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 4, 0, 'Вон за тем хребтом, в низине Шолазар, я повстречал племена оракулов – волчеров и мурлоков. Такие странные создания!', 12, 0, 100, 0, 0, 0, 126681, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 5, 0, 'Из всех моих странствий этот день стоит особняком. Все было как будто вчера...', 12, 0, 100, 0, 0, 0, 126682, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 6, 0, 'Однако я совсем вас заболтал. Наверняка у вас тоже есть интересные истории о своих путешествиях!', 12, 0, 100, 0, 0, 0, 126683, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118354, 7, 0, 'Вот, например, ты, $n – в каких необычных местах тебе довелось побывать? ', 12, 0, 100, 0, 0, 0, 126686, 'Чэнь Буйный Портер to Player'),
(118354, 8, 0, 'А как насчет тебя, $n?', 12, 0, 100, 0, 0, 0, 126687, 'Чэнь Буйный Портер to Player'),
(118354, 9, 0, 'А ты, $n? Что больше всего запомнилось тебе в твоих путешествиях?', 12, 0, 100, 0, 0, 0, 126688, 'Чэнь Буйный Портер to Player'),
(118354, 10, 0, 'Ну ладно, вы пока тут болтайте, а мне нужно править шаром – а то еще врежемся прямо в Даларан, неровен час.', 12, 0, 100, 0, 0, 0, 126689, 'Чэнь Буйный Портер to Воздушный шар Чэня'),
(118470, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Чэнь Буйный Портер to Player'),
(118297, 0, 0, 'Ваша группа приняла решение выбросить Шнотца с воздушного шара!', 42, 0, 100, 0, 0, 0, 127460, 'Воздушный шар Шнотца to Player'),
(118340, 0, 0, 'Поппрошу вашего фнимания.', 12, 0, 100, 0, 0, 0, 126630, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 1, 0, 'Наш шар не очень фместителен.', 12, 0, 100, 0, 0, 0, 126631, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 2, 0, 'У нас строкие прафила: не болтайт, не прыгайт и не раскачивайт гондолу.', 12, 0, 100, 0, 0, 0, 126632, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 3, 0, 'Не скакайт!', 12, 0, 100, 0, 0, 0, 126633, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 4, 0, 'Соблюдайт праффила, иначе вас ждет штрафф.', 12, 0, 100, 0, 0, 0, 126634, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 5, 0, 'Нас ждет удифительный полет. Фсем радофаться. Понимайт?', 12, 0, 100, 0, 0, 0, 126635, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 6, 0, 'Гут. А тепер один час фсем ситеть тихо! ', 12, 0, 100, 0, 0, 0, 126636, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118340, 7, 0, 'Йа это саслужил!', 12, 0, 100, 0, 0, 0, 126638, 'Командующий воздушным шаром Шнотц to Воздушный шар Шнотца'),
(118482, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Командующий воздушным шаром Шнотц to Player'),
(118355, 0, 0, 'Как, опять пассажиры? Ладно, залезайте внутрь...', 12, 0, 100, 0, 0, 0, 126690, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 1, 0, 'Мы направляемся в Полугорье. Прошу руки наружу не высовывать! ', 12, 0, 100, 0, 0, 0, 126691, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 2, 0, '<Вздох>...', 12, 0, 100, 0, 0, 0, 126692, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 3, 0, 'Прямо под нами справа вы видите усадьбу Пана. Обязательно посмотрите...', 12, 0, 100, 0, 0, 0, 126694, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 4, 0, 'А вообще знаете, что? С меня хватит!', 12, 0, 100, 0, 0, 0, 126695, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 5, 0, 'Признаюсь честно вам троим.', 12, 0, 100, 0, 0, 0, 126696, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 6, 0, 'Я ненавижу воздушные шары! Никогда их не любил. Я всегда хотел быть шаманом, но нет же! Ведь "полеты на воздушных шарах у нас в крови"!', 12, 0, 100, 0, 0, 0, 126697, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 7, 0, 'Что, нравится, отец? А? Надеюсь, теперь ты мной доволен!', 12, 0, 100, 0, 0, 0, 126698, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 8, 0, 'Так-то вот...', 12, 0, 100, 0, 0, 0, 126699, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 9, 0, 'Да уж.', 12, 0, 100, 0, 0, 0, 126700, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 10, 0, 'Как камень с души... Никогда еще никому об этом не говорил.', 12, 0, 100, 0, 0, 0, 126701, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 11, 0, 'Теперь вы знаете мою тайну. А у вас есть какой-нибудь секрет?', 12, 0, 100, 0, 0, 0, 126702, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118355, 12, 0, 'Давай, $n. Расскажи нам то, в чем еще никому не $gпризнавался:признавалась;. Начинай!', 12, 0, 100, 0, 0, 0, 126703, 'Линь Облачный Странник to Player'),
(118355, 13, 0, 'А ты, $n? Тебя тяготит какая-нибудь тайна?', 12, 0, 100, 0, 0, 0, 126704, 'Линь Облачный Странник to Player'),
(118355, 14, 0, 'Теперь твой черед, $n. Открой нам какой-нибудь секрет! Мы не осудим! И никому не расскажем!', 12, 0, 100, 0, 0, 0, 126705, 'Линь Облачный Странник to Player'),
(118355, 15, 0, 'Это был самый откровенный полет в моей карьере. Хотя мне даже понравилось. Спасибо вам всем!', 12, 0, 100, 0, 0, 0, 126706, 'Линь Облачный Странник to Экспресс Облачных Странников'),
(118474, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Линь Облачный Странник to Player'),
(118351, 0, 0, 'Прошу на борт, начинающие воздухоплаватели! Кому наклейку с воздушным шаром? Прошу, не стесняйтесь!', 12, 0, 100, 0, 0, 0, 126655, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 1, 0, 'У нас самые шикарные полеты на воздушном шаре во всем Азероте! Кого угодно спросите – вам подтвердят!', 12, 0, 100, 0, 0, 0, 126656, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 2, 0, 'Сегодня мы полетим над Азсуной, жемчужиной Расколотых островов.', 12, 0, 100, 0, 0, 0, 126658, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 3, 0, 'Прямо под нами находится академия Нар''таласа. Это, вроде бы, древняя школа магов.', 12, 0, 100, 0, 0, 0, 126660, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 4, 0, 'Рангл, разожги-ка мангал да подготовь фейерверки.', 12, 0, 100, 0, 0, 0, 126662, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 5, 0, 'Вы, наверное, удивляетесь: как я умудряюсь организовывать столь роскошные экскурсии на воздушном шаре и до сих пор не вылетел в трубу?', 12, 0, 100, 0, 0, 0, 126664, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 6, 0, 'Все очень просто – дело в том, что о стоимости тура клиенты узнают, когда шар уже находится в воздухе!', 12, 0, 100, 0, 0, 0, 126665, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 7, 0, 'Так что с вас с каждого по двадцать восемь косарей золотых – плюс чаевые. Давайте раскошеливайтесь, если не хотите, чтобы Рангл переломал вам ноги.', 12, 0, 100, 0, 0, 0, 126666, 'Боско to Небесная колесница Боско и Рангла'),
(118351, 8, 0, 'ЧТО?! Рангл, ты опять накосячил!!!', 12, 0, 100, 0, 0, 0, 126668, 'Боско to Небесная колесница Боско и Рангла'),
(118352, 0, 0, 'Не угодно ли бесплатных напитков? Угощайтесь!', 12, 0, 100, 0, 0, 0, 126657, 'Рангл to Боско'),
(118352, 1, 0, 'Икры кто-нибудь желает? Она у нас отменная.', 12, 0, 100, 0, 0, 0, 126659, 'Рангл to Боско'),
(118352, 2, 0, 'Горячее полотенце? Все для наших клиентов!', 12, 0, 100, 0, 0, 0, 126661, 'Рангл to Боско'),
(118352, 3, 0, 'Не вопрос, босс.', 12, 0, 100, 0, 0, 0, 126663, 'Рангл to Боско'),
(118352, 4, 0, 'Готово, босс. Я разложил фейерверки на мангале, как ты и велел.', 12, 0, 100, 0, 0, 0, 126667, 'Рангл to Боско'),
(118467, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Боско to Player'),
(118468, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Рангл to Player'),
(118357, 0, 0, 'Приветствую! Заходите в гондолу... и готовьтесь к самому поучительному путешествию в своей жизни!', 12, 0, 100, 0, 0, 0, 126719, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 1, 0, 'Сегодня нам предстоит совершить обзорный полет над древним городом Сурамаром.', 12, 0, 100, 0, 0, 0, 126720, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 2, 0, 'Но сначала проведем небольшую перекличку.', 12, 0, 100, 0, 0, 0, 126721, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 3, 0, '$n? $n здесь?', 12, 0, 100, 0, 0, 0, 126722, 'Цзан Облачный Странник to Player'),
(118357, 4, 0, 'Просто ответь "здесь".', 12, 0, 100, 0, 0, 0, 126723, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 5, 0, 'Хорошо. А $n здесь?', 12, 0, 100, 0, 0, 0, 126724, 'Цзан Облачный Странник to Player'),
(118357, 6, 0, 'Отметил. Далее по списку – $n. Это, я так понимаю, ты?', 12, 0, 100, 0, 0, 0, 126725, 'Цзан Облачный Странник to Player'),
(118357, 7, 0, 'Ну все, хватит разговоров. Отправляемся!', 12, 0, 100, 0, 0, 0, 126726, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 8, 0, 'Как вы знаете, Сурамар – дом ночнорожденных эльфов.', 12, 0, 100, 0, 0, 0, 126727, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 9, 0, 'Помимо прочего, ночнорожденные славятся своим сварливым характером.', 12, 0, 100, 0, 0, 0, 126729, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 10, 0, '$n, скажи мне, какую необычную субстанцию используют ночнорожденные для релаксации?', 12, 0, 100, 0, 0, 0, 126730, 'Цзан Облачный Странник to Player'),
(118357, 11, 0, 'Правильный ответ – конечно же, ману.', 12, 0, 100, 0, 0, 0, 126731, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 12, 0, 'Из-за огромного количества маны, что они потребляют, их тела претерпели изменения.', 12, 0, 100, 0, 0, 0, 126732, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 13, 0, '$n, какая часть тела ночнорожденных претерпела наиболее заметные изменения из-за чрезмерного потребления маны?', 12, 0, 100, 0, 0, 0, 126733, 'Цзан Облачный Странник to Player'),
(118357, 14, 0, 'Почти угадали! Это их кожа.', 12, 0, 100, 0, 0, 0, 126734, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 15, 0, 'И, наконец, $n, последний вопрос. Как звучит традиционное приветствие в Сурамаре?', 12, 0, 100, 0, 0, 0, 126735, 'Цзан Облачный Странник to Player'),
(118357, 16, 0, 'Неплохая версия! Правильный ответ: "Это иллюзия! Что ты скрываешь?"', 12, 0, 100, 0, 0, 0, 126736, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118357, 17, 0, 'На сегодня урок окончен. Благодарю вас за полет... и подготовьтесь в следующий раз получше!', 12, 0, 100, 0, 0, 0, 126737, 'Цзан Облачный Странник to Экспресс Облачных Странников'),
(118436, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Цзан Облачный Странник to Player'),
(94409, 0, 0, 'Думаю, ты отлично впишешься в мой охотничий отряд!', 12, 0, 100, 0, 0, 0, 121032, 'Хеминг Эрнестуэй to Player'),
(94409, 1, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Хеминг Эрнестуэй to Player'),
(118353, 0, 0, 'Друзья, рад приветствовать вас на воздушном шаре Эрнестуэя! Вас ждет увлекательная экскурсия по Крутогорью.', 12, 0, 100, 0, 0, 0, 126669, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 1, 0, 'Я этот шар купил у гоблина, который утверждал, что с него очень удобно стрелять по лосям!', 12, 0, 100, 0, 0, 0, 126670, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 2, 0, 'Увы, в последнее время... В общем, не знаю. Как-то все уныло. Охота уже не приносит мне былой радости.', 12, 0, 100, 0, 0, 0, 126671, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 3, 0, 'Даже пальба по зверью с воздушного шара уже не горячит кровь так, как прежде.', 12, 0, 100, 0, 0, 0, 126672, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 4, 0, 'Ну вот, опять меня одолела меланхолия.', 12, 0, 100, 0, 0, 0, 127343, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 5, 0, 'Кто-нибудь знает хороший анекдот? Ну вот например...', 12, 0, 100, 0, 0, 0, 127344, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 6, 0, 'Почему дворфы-охотники предпочитают ружья?', 12, 0, 100, 0, 0, 0, 127345, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 7, 0, 'Потому что в лук нельзя налить эль!', 12, 0, 100, 0, 0, 0, 127346, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 8, 0, 'Хе-хе! И не смотрите на меня, мне так шутить можно. Я ведь сам и дворф – и охотник!', 12, 0, 100, 0, 0, 0, 127347, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 9, 0, '$n, теперь твоя очередь.', 12, 0, 100, 0, 0, 0, 126673, 'Хеминг Эрнестуэй to Player'),
(118353, 10, 0, 'А как насчет тебя, $n?', 12, 0, 100, 0, 0, 0, 126674, 'Хеминг Эрнестуэй to Player'),
(118353, 11, 0, 'Ну или ты, $n. Кто-нибудь, развеселите меня!', 12, 0, 100, 0, 0, 0, 126675, 'Хеминг Эрнестуэй to Player'),
(118353, 12, 0, 'Ой-ой... близковато мы подошли... Все помашите ручкой Громовому Тотему!', 12, 0, 100, 0, 0, 0, 126676, 'Хеминг Эрнестуэй to Привет, оружие'),
(118353, 13, 0, 'Ну что, я снова повеселел! Спасибо, что составили компанию старому охотнику!', 12, 0, 100, 0, 0, 0, 127348, 'Хеминг Эрнестуэй to Привет, оружие'),
(118356, 0, 0, 'Приветствую вас на борту! Сегодня я буду вашим гидом по Штормхейму.', 12, 0, 100, 0, 0, 0, 126707, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 1, 0, 'Итак, видите там внизу что-то виднеется? Это... хм... это Штормхейм.', 12, 0, 100, 0, 0, 0, 126708, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 2, 0, 'Простите, я не самый опытный гид на свете.', 12, 0, 100, 0, 0, 0, 126709, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 3, 0, 'Может... во что-нибудь поиграем в полете?', 12, 0, 100, 0, 0, 0, 126710, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 4, 0, 'Я знаю одну игру. Она называется "Поцелуй, женись или убей."', 12, 0, 100, 0, 0, 0, 126711, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 5, 0, 'Правила простые: вначале выбираешь кого-то, кого бы ты $gпоцеловал:поцеловала;, затем кого-то, $gна ком бы ты женился:за кого бы ты вышла замуж;, а потом кого-то, кого бы ты $gубил:убила;.', 12, 0, 100, 0, 0, 0, 126712, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 6, 0, 'Итак... Мой первый выбор...', 12, 0, 100, 0, 0, 0, 126713, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118356, 7, 0, '$n, у тебя милое лицо, плюс ты $gединственный:единственная;, кто тут чистит зубы. Так что я бы поцеловала тебя.', 12, 0, 100, 0, 0, 0, 126714, 'Эми-Лань to Player'),
(118356, 8, 0, 'И, конечно же, я бы убила |3-3($n).', 12, 0, 100, 0, 0, 0, 126715, 'Эми-Лань to Player'),
(118356, 9, 0, 'Остается $n. Выходит за тебя бы я вышла замуж. Не самый плохой вариант.', 12, 0, 100, 0, 0, 0, 126716, 'Эми-Лань to Player'),
(118356, 10, 0, 'Все, теперь ваша очередь!', 12, 0, 100, 0, 0, 0, 126717, 'Эми-Лань to Воздушный лайнер Эми-Лань'),
(118443, 0, 0, 'Воздушный шар отправится в полет, как только три пассажира будут готовы.', 12, 0, 100, 0, 0, 0, 127453, 'Эми-Лань to Player');

REPLACE INTO `creature_template_addon` (`entry`, `mount`, `bytes1`, `bytes2`, `auras`) VALUES 
(118442, 0, 0x3000000, 0x1, ''),
(118367, 0, 0x3000000, 0x1, ''),
(118364, 0, 0x3000000, 0x1, ''),
(118435, 0, 0x3000000, 0x1, ''),
(118359, 0, 0x3000000, 0x1, ''),
(118366, 0, 0x3000000, 0x1, ''),
(118481, 0, 0x3000000, 0x1, ''),
(118297, 0, 0x3000000, 0x1, ''),
(118363, 0, 0x3000000, 0x1, ''),
(118365, 0, 0x3000000, 0x1, ''),
(118469, 0, 0x3000000, 0x1, ''),
(118446, 0, 0x3000000, 0x1, ''),
(118466, 0, 0x3000000, 0x1, ''),
(118473, 0, 0x3000000, 0x1, '');

DELETE FROM creature_template WHERE entry in (118356,118367,118443,118442,118354,118365,118469,118470,118435,118436,118357,118359,118355,118366,118473,118474,118353,118364,118446,118297,118340,118481,118482,118351,118352,118363,118466,118467,118468);
INSERT INTO `creature_template` (`entry`, `trainer_type`, `gossip_menu_id`, `exp`, `minlevel`, `maxlevel`, `faction`, `npcflag`, `npcflag2`, `RangeAttackTime`, `unit_class`, `unit_flags`, `unit_flags2`, `unit_flags3`, `VehicleId`, `HoverHeight`, `InhabitType`, `SandboxScalingID`, `ScaleLevelMin`, `ScaleLevelMax`, `ScaleLevelDelta`, `ScaleLevelDuration`, `ControllerID`, `StateWorldEffectID`, `SpellStateVisualID`, `SpellStateAnimID`, `SpellStateAnimKitID`, `WorldEffects`, `PassiveSpells`, `flags_extra`, `speed_walk`, `speed_run`, `BaseAttackTime`) VALUES
(118356, 0, 0, 0, 110, 110, 190, 0, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118356
(118367, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 5160, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118367
(118442, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118442
(118443, 0, 20820, 0, 110, 110, 190, 1, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118443
(118353, 0, 0, 0, 110, 110, 190, 0, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118353
(118364, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 5157, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118364
(118446, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118446
(118354, 0, 0, 0, 110, 110, 190, 0, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118354
(118365, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 5158, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118365
(118469, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118469
(118470, 0, 20820, 0, 110, 110, 190, 1, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118470
(118435, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118435
(118436, 0, 20820, 0, 110, 110, 190, 1, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118436
(118357, 0, 0, 0, 110, 110, 190, 0, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118357
(118359, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 5154, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118359
(118297, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 5144, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118297
(118340, 0, 0, 0, 85, 85, 190, 0, 0, 2000, 2, 256, 4194304, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118340
(118481, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118481
(118482, 0, 20820, 0, 85, 85, 190, 1, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 2000, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118482
(118351, 0, 0, 0, 110, 110, 190, 0, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118351
(118352, 0, 0, 0, 110, 110, 190, 0, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118352
(118363, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 5156, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118363
(118466, 0, 0, 0, 110, 110, 35, 0, 0, 2000, 1, 0, 2048, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 3.2, 2, 2000), -- 118466
(118467, 0, 20820, 0, 110, 110, 190, 1, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000), -- 118467
(118468, 0, 20820, 0, 110, 110, 190, 1, 0, 2000, 2, 256, 0, 1, 0, 1, 3, 0, 0, 0, 0, 100, -1, 0, 0, 0, 0, '', '', 0, 1, 1.142857, 2000); -- 118468
INSERT INTO `creature_template` (`entry`, `gossip_menu_id`, `minlevel`, `maxlevel`, `SandboxScalingID`, `ScaleLevelMin`, `ScaleLevelMax`, `ScaleLevelDelta`, `ScaleLevelDuration`, `exp`, `faction`, `npcflag`, `npcflag2`, `speed_walk`, `speed_run`, `speed_fly`, `scale`, `mindmg`, `maxdmg`, `dmgschool`, `attackpower`, `dmg_multiplier`, `baseattacktime`, `rangeattacktime`, `unit_class`, `unit_flags`, `unit_flags2`, `unit_flags3`, `dynamicflags`, `trainer_type`, `trainer_spell`, `trainer_class`, `trainer_race`, `minrangedmg`, `maxrangedmg`, `rangedattackpower`, `lootid`, `pickpocketloot`, `skinloot`, `resistance1`, `resistance2`, `resistance3`, `resistance4`, `resistance5`, `resistance6`, `spell1`, `spell2`, `spell3`, `spell4`, `spell5`, `spell6`, `spell7`, `spell8`, `PetSpellDataId`, `VehicleId`, `mingold`, `maxgold`, `AIName`, `MovementType`, `InhabitType`, `HoverHeight`, `Mana_mod_extra`, `Armor_mod`, `RegenHealth`, `mechanic_immune_mask`, `flags_extra`, `ControllerID`, `WorldEffects`, `PassiveSpells`, `StateWorldEffectID`, `SpellStateVisualID`, `SpellStateAnimID`, `SpellStateAnimKitID`, `IgnoreLos`, `AffixState`, `ScriptName`) VALUES 
('118474', '0', '110', '110', '0', '0', '0', '0', '0', '0', '190', '1', '0', '1', '1.14286', '1.14286', '1', '0', '0', '0', '0', '1', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '', '0', '3', '1', '1', '1', '1', '0', '0', '0', '', '', '0', '0', '0', '0', '0', '0', '');

DELETE FROM `vehicle_template_accessory` WHERE `EntryOrAura` in (118367,118364,118359,118363,118366,118365,118297);
INSERT INTO `vehicle_template_accessory` (`EntryOrAura`, `accessory_entry`, `seat_id`, `minion`, `description`, `summontype`, `summontimer`, `offsetX`, `offsetY`, `offsetZ`, `offsetO`) VALUES
(118367, 118356, 3, 1, '118367 - 118356', 8, 0, -0.9238, -0.9551, 0.1291, 0.7853985), -- 118367 - 118356
(118364, 118353, 3, 1, '118364 - 118353', 8, 0, -1, 1, 0.5008677, 5.497787), -- 118364 - 118353
(118359, 118357, 3, 1, '118359 - 118357', 8, 0, -0.9238, -0.9551, 0.1291, 0.7853985), -- 118359 - 118357
(118363, 118351, 3, 1, '118363 - 118351', 8, 0, -1, 1, 0.5008677, 5.497787), -- 118363 - 118351
(118363, 118352, 4, 1, '118363 - 118352', 8, 0, -0.5, 2.5, 1.500868, 4.799656), -- 118363 - 118352
(118366, 118355, 3, 1, '118366 - 118355', 8, 0, -0.9238, -0.9551, 0.1291, 0.7853985), -- 118366 - 118355
(118365, 118354, 3, 1, '118365 - 118354', 8, 0, -0.9238, -0.9551, 0.1291, 0.7853985), -- 118365 - 118354
(118297, 118340, 3, 1, '118297 - 118340', 8, 0, -1, 1, 0.5008677, 5.497787); -- 118297 - 118340

DELETE FROM `npc_spellclick_spells` WHERE `npc_entry`=118367;
REPLACE INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`) VALUES
(118367, 46598, 1, 0),
(118364, 46598, 1, 0),
(118359, 46598, 1, 0),
(118363, 46598, 1, 0),
(118366, 46598, 1, 0),
(118365, 46598, 1, 0),
(118297, 46598, 1, 0);

DELETE FROM gossip_menu WHERE entry in (20820,18623);
INSERT INTO `gossip_menu` (`Entry`, `TextID`, `FriendshipFactionID`) VALUES
(20820, 31258, 0), -- 118470
(18623, 27011, 0); -- 94409

DELETE FROM `npc_text` WHERE `ID`=31258;
INSERT INTO `npc_text` (`ID`, `Probability0`, `Probability1`, `Probability2`, `Probability3`, `Probability4`, `Probability5`, `Probability6`, `Probability7`, `BroadcastTextId0`, `BroadcastTextId1`, `BroadcastTextId2`, `BroadcastTextId3`, `BroadcastTextId4`, `BroadcastTextId5`, `BroadcastTextId6`, `BroadcastTextId7`, `VerifiedBuild`) VALUES
(31258, 1, 0, 0, 0, 0, 0, 0, 0, 126776, 0, 0, 0, 0, 0, 0, 0, 26365); -- 31258

DELETE FROM gossip_menu_option WHERE MenuID in (20820,18623);
INSERT INTO `gossip_menu_option` (`MenuID`, `OptionIndex`, `OptionNPC`, `OptionText`, `OptionType`, `OptionNpcflag`, `OptionNpcflag2`, `ActionMenuID`, `ActionPoiID`, `BoxCoded`, `BoxMoney`, `BoxText`, `OptionBroadcastTextID`, `BoxBroadcastTextID`) VALUES
(20820, 0, 0, 'Да!', 1, 1, 0, 0, 0, 0, 0, '', 0, 0),
(18623, 0, 0, 'Можно прокатиться на твоем воздушном шаре?', 1, 1, 0, 0, 0, 0, 0, '', 0, 0);

DELETE FROM conditions WHERE SourceTypeOrReferenceId = 15 and SourceGroup in (20820,18623) and SourceEntry = 0;
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
('15', '20820', '0', '0', '0', '12', '0', '87', '0', '0', '0', '0', '', 'true if active event'),
('15', '18623', '0', '0', '0', '12', '0', '87', '0', '0', '0', '0', '', 'true if active event');

DELETE FROM game_event_gameobject WHERE eventEntry = 87;
DELETE FROM game_event_creature WHERE eventEntry = 87;
REPLACE INTO `game_event_gameobject` (`eventEntry`, `guid`) SELECT 87, guid FROM gameobject WHERE id in (267657,267658);
REPLACE INTO `game_event_creature` (`eventEntry`, `guid`) SELECT 87, guid FROM creature WHERE id in (118482,118469,118470,118340,118481,118474,118473,118466,118467,118468,118435,118436,118446,118443,118442,118473);

UPDATE `creature_template` SET `ScriptName`='npc_chens' WHERE (`entry`='118470');
UPDATE `creature_template` SET `ScriptName`='npc_scgnottz_vh' WHERE (`entry`='118340');
UPDATE `creature_template` SET `ScriptName`='npc_lin_cloudwalker' WHERE (`entry`='118474');
UPDATE `creature_template` SET `ScriptName`='npc_rungle' WHERE (`entry`='118468');
UPDATE `creature_template` SET `ScriptName`='npc_zang_cloudwalker' WHERE (`entry`='118436');
UPDATE `creature_template` SET `AIName`='', `ScriptName`='npc_hemet_nesingwary' WHERE (`entry`='94409');
UPDATE `creature_template` SET `ScriptName`='npc_emi_lan' WHERE (`entry`='118443');
UPDATE `creature_template` SET `ScriptName`='npc_chens_vh' WHERE (`entry`='118354');
UPDATE `creature_template` SET `ScriptName`='npc_scgnottz' WHERE (`entry`='118482');
UPDATE `creature_template` SET `ScriptName`='npc_lin_cloudwalker_vh' WHERE (`entry`='118355');
UPDATE `creature_template` SET `ScriptName`='npc_boscoe_vh' WHERE (`entry`='118351');
UPDATE `creature_template` SET `ScriptName`='npc_rungle_vh' WHERE (`entry`='118352');
UPDATE `creature_template` SET `ScriptName`='npc_zang_cloudwalker_vh' WHERE (`entry`='118357');
UPDATE `creature_template` SET `ScriptName`='npc_hemet_nesingwary_vh' WHERE (`entry`='118353');
UPDATE `creature_template` SET `ScriptName`='npc_emi_lan_vh' WHERE (`entry`='118356');
UPDATE `creature_template` SET `ScriptName`='npc_scgnottz_ballon' WHERE (`entry`='118297');
UPDATE `creature_template` SET `ScriptName`='npc_sky_chariot' WHERE (`entry`='118363');
UPDATE `creature_template` SET `ScriptName`='npc_chens_balloon' WHERE (`entry`='118365');
UPDATE `creature_template` SET `ScriptName`='npc_cloudwalker_express' WHERE (`entry`='118359');
UPDATE `creature_template` SET `ScriptName`='npc_cloudwalker_express_mop' WHERE (`entry`='118366');
UPDATE `creature_template` SET `ScriptName`='npc_the_killemjaro' WHERE (`entry`='118364');
UPDATE `creature_template` SET `ScriptName`='npc_emi_lans_skylounge' WHERE (`entry`='118367');
UPDATE creature_template SET InhabitType=4, `speed_walk`='1.14286', `speed_run`='1.14286', `speed_fly`='1.14286' WHERE entry in (118367,118364,118359,118363,118366,118365,118297);

DELETE FROM game_event WHERE eventEntry in (87);
INSERT INTO `game_event` (`eventEntry`, `start_time`, `end_time`, `occurence`, `length`, `holiday`, `description`, `world_event`) VALUES 
('87', '2018-05-10 00:00:00', '2025-05-13 00:00:00', '525600', '4320', '0', 'Spring Balloon Festival', '0');

DELETE FROM spell_script_names WHERE spell_id in (236346,234941);
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES
('236346', 'spell_schnottz_has_to_go'),
('234941', 'spell_waiting_for_balloon');

DELETE FROM spell_area WHERE spell in (234941);
INSERT INTO `spell_area` (`spell`, `area`, `quest_start`, `quest_end`, `aura_spell`, `racemask`, `classmask`, `active_event`, `gender`, `autocast`, `quest_start_status`, `quest_end_status`) VALUES
('234941', '7840', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11'),
('234941', '8167', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11'),
('234941', '7733', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11'),
('234941', '7360', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11'),
('234941', '4554', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11'),
('234941', '5466', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11'),
('234941', '5936', '0', '0', '0', '0', '0', '0', '2', '0', '64', '11');

SET @NPC := 118365;
DELETE FROM waypoint_data_script WHERE id in (118365);
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,5264.822,-659.8837,229.6127,0,0,1,0,0,100,@NPC,0),
(@NPC,2,5323.994,-509.1163,261.3188,0,0,1,0,0,100,@NPC,0),
(@NPC,3,5430.332,-375.526,334.08,0,0,1,0,0,100,@NPC,0),
(@NPC,4,5443.745,-154.6927,334.08,0,0,1,0,0,100,@NPC,0),
(@NPC,5,5315.796,292.4809,334.08,0,0,1,0,0,100,@NPC,0),
(@NPC,6,5717.851,322.033,641.5903,0,0,1,0,0,100,@NPC,0),
(@NPC,7,5799.407,413.1649,669.7328,0,0,1,0,0,100,@NPC,0),
(@NPC,8,5814.243,446.8507,667.909,0,0,1,0,0,100,@NPC,0);

SET @NPC := 118297;
DELETE FROM `waypoint_data_script` WHERE `id`=@NPC;
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,-9519.219,-1012.946,112.8363,0,0,1,0,0,100,@NPC,0),
(@NPC,2,-9517.851,-1033.017,133.2927,0,0,1,0,0,100,@NPC,0),
(@NPC,3,-9637.109,-1232.451,155.6713,0,0,1,0,0,100,@NPC,0),
(@NPC,4,-9782.024,-1531.014,212.4904,0,0,1,0,0,100,@NPC,0),
(@NPC,5,-10152.25,-1553.637,242.3398,0,0,1,0,0,100,@NPC,0),
(@NPC,6,-10402.53,-1515.99,242.3398,0,0,1,0,0,100,@NPC,0);

SET @NPC := 118366;
DELETE FROM `waypoint_data_script` WHERE `id`=@NPC;
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,545.6146,-647.9879,265.3657,0,0,1,0,0,100,@NPC,0),
(@NPC,2,520.8386,-629.4809,289.9522,0,0,1,0,0,100,@NPC,0),
(@NPC,3,366.0347,-484.1719,289.9522,0,0,1,0,0,100,@NPC,0),
(@NPC,4,334.1458,-201.4549,289.9522,0,0,1,0,0,100,@NPC,0),
(@NPC,5,276.0365,187.9705,235.6672,0,0,1,0,0,100,@NPC,0),
(@NPC,6,177.8958,418.8507,235.6672,0,0,1,0,0,100,@NPC,0),
(@NPC,7,-33.06945,382.5695,235.6672,0,0,1,0,0,100,@NPC,0),
(@NPC,8,-189.3004,405.349,167.6209,0,0,1,0,0,100,@NPC,0);

SET @NPC := 118363;
DELETE FROM `waypoint_data_script` WHERE `id`=@NPC;
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,470.1024,6511.487,48.17675,0,0,1,0,0,100,@NPC,0),
(@NPC,2,471.4826,6495.887,70.14487,0,0,1,0,0,100,@NPC,0),
(@NPC,3,337.5451,6453.578,70.14487,0,0,1,0,0,100,@NPC,0),
(@NPC,4,134.8403,6433.174,59.43941,0,0,1,0,0,100,@NPC,0),
(@NPC,5,-96.84375,6291.818,70.14487,0,0,1,0,0,100,@NPC,0),
(@NPC,6,-140.0125,6257.549,95.11362,0,0,1,0,0,100,@NPC,0);

SET @NPC := 118359;
DELETE FROM `waypoint_data_script` WHERE `id`=@NPC;
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,1647.594,4791.604,145.4116,0,0,1,0,0,100,@NPC,0),
(@NPC,2,1617.76,4793.814,165.7608,0,0,1,0,0,100,@NPC,0),
(@NPC,3,1601.705,4790.89,192.2706,0,0,1,0,0,100,@NPC,0),
(@NPC,4,1570.392,4759.723,210.2789,0,0,1,0,0,100,@NPC,0),
(@NPC,5,1537.245,4633.728,210.2789,0,0,1,0,0,100,@NPC,0),
(@NPC,6,1403.078,4376.856,214.9195,0,0,1,0,0,100,@NPC,0),
(@NPC,7,1307.243,4142.909,240.8334,0,0,1,0,0,100,@NPC,0),
(@NPC,8,1586.858,3745.601,245.7996,0,0,1,0,0,100,@NPC,0),
(@NPC,9,1743.705,3459.093,214.9195,0,0,1,0,0,100,@NPC,0),
(@NPC,10,1799.177,3209.014,231.4199,0,0,1,0,0,100,@NPC,0),
(@NPC,11,1884.66,3103.138,227.517,0,0,1,0,0,100,@NPC,0);

SET @NPC := 118364;
DELETE FROM `waypoint_data_script` WHERE `id`=@NPC;
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,4515.343,4842.72,696.1126,0,0,1,0,0,100,@NPC,0),
(@NPC,2,4534.049,4827.227,719.6717,0,0,1,0,0,100,@NPC,0),
(@NPC,3,4630.383,4671.424,719.6717,0,0,1,0,0,100,@NPC,0),
(@NPC,4,4725.519,4352.373,849.5474,0,0,1,0,0,100,@NPC,0),
(@NPC,5,4594.453,4258.94,900.7316,0,0,1,0,0,100,@NPC,0),
(@NPC,6,4357.405,4278.792,882.1014,0,0,1,0,0,100,@NPC,0),
(@NPC,7,4218.363,4359.028,777.1415,0,0,1,0,0,100,@NPC,0),
(@NPC,8,4147.451,4487.283,777.1415,0,0,1,0,0,100,@NPC,0),
(@NPC,9,4317.465,4651.604,703.8075,0,0,1,0,0,100,@NPC,0),
(@NPC,10,4487.096,4823.842,668.0374,0,0,1,0,0,100,@NPC,0);

SET @NPC := 118367;
DELETE FROM `waypoint_data_script` WHERE `id`=@NPC;
INSERT INTO `waypoint_data_script` (`id`,`point`,`position_x`,`position_y`,`position_z`,`orientation`,`delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES
(@NPC,1,3848.938,2068.724,280.8855,0,0,1,0,0,100,@NPC,0),
(@NPC,2,3877.958,2112.731,311.9858,0,0,1,0,0,100,@NPC,0),
(@NPC,3,3960.759,2278.523,429.8335,0,0,1,0,0,100,@NPC,0),
(@NPC,4,3983.881,2425.024,429.8335,0,0,1,0,0,100,@NPC,0),
(@NPC,5,3982.828,2571.167,410.9255,0,0,1,0,0,100,@NPC,0),
(@NPC,6,3890.304,2631.768,410.9255,0,0,1,0,0,100,@NPC,0),
(@NPC,7,3598.135,2728.062,436.4358,0,0,1,0,0,100,@NPC,0),
(@NPC,8,3547.023,2758.669,432.9745,0,0,1,0,0,100,@NPC,0);