delete from creature_template_addon where entry in (26125,24207,100876,104493,99737,98035,89,95061,95072,29264,19668,62982);
update creature_template_addon set auras = '' where entry in (27829);

delete from spell_pet_auras where petEntry in (26125,27829,24207,103822,100876,64618,62855,104493,103673,99737,98035,11859,89,95061,95072,29264,108452,19668,62982);
INSERT INTO `spell_pet_auras` (`petEntry`, `spellId`, `option`, `target`, `targetaura`, `bp0`, `bp1`, `bp2`, `aura`, `casteraura`, `createdspell`, `fromspell`, `comment`) VALUES
(26125, -46584, 5, 1, 0, 99541, 0, 0, 0, 0, 0, 0, 'Удаление тихоступа'),
(26125, 47448, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Появление восставшего вурдалака'),
(26125, 47466, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Восставший союзник - Самооглушение восставшего вурдалака'),
(26125, 121916, 0, 0, 1, 0, 0, 0, 58640, 0, 0, 0, 'Символ упыря'),
(26125, 147157, 0, 0, 1, 0, 0, 0, 146652, 0, 0, 0, 'Символ скелета'),

(27829, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Призыв горгульи - Избежание'),
(27829, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Призыв горгульи - Player Damage Reduction'),
(27829, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Призыв горгульи - Снижение урона по игроку 90го уровня'),

(24207, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Войско мертвых - Избежание'),
(24207, -218321, 0, 0, 1, 0, 0, 0, 191637, 0, 0, 0, 'Войско мертвых - Утаскивание в Хельхейм'),
(24207, 7398, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Войско мертвых - Рождение'),
(24207, 43264, 0, 0, 1, 0, 0, 0, 137008, 0, 0, 0, 'Войско мертвых - Периодическая провокация'),
(24207, 127517, 0, 0, 1, 0, 0, 0, 58642, 0, 0, 0, 'Войско мертвых - Символ нечестивого зверинца'),
(24207, 233112, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Войско мертвых - Войско мертвых'),

(103822, 37846, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Сила природы'),
(103822, 205644, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Сила Природы'),
(103822, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Сила природы - Избежание'),
(103822, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Сила природы - Player Damage Reduction'),
(103822, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Сила природы - Снижение урона по игроку 90го уровня'),

(100876, 141918, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Валь\'кира-воительница - Fixate'),
(100876, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Валь\'кира-воительница - Избежание'),
(100876, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Валь\'кира-воительница - Player Damage Reduction'),
(100876, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Валь\'кира-воительница - Снижение урона по игроку 90го уровня'),

(64618, 213466, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Сосредоточение внимания'),
(64618, 215778, 0, 0, 1, 0, 0, 0, 215779, 0, 0, 0, 'Ужасный зверь - Ужасный зверь'),
(64618, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Избежание'),
(64618, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Player Damage Reduction'),
(64618, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Снижение урона по игроку 90го уровня'),

(62855, 213466, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Сосредоточение внимания'),
(62855, 215778, 0, 0, 1, 0, 0, 0, 215779, 0, 0, 0, 'Ужасный зверь - Ужасный зверь'),
(62855, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Избежание'),
(62855, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Player Damage Reduction'),
(62855, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Ужасный зверь - Снижение урона по игроку 90го уровня'),

-- По снифу не наложились, странно...
-- (104493, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Плюющаяся кобра - Избежание'),
-- (104493, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Плюющаяся кобра - Player Damage Reduction'),
-- (104493, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Плюющаяся кобра - Снижение урона по игроку 90го уровня'),
(104493, 237838, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Плюющаяся кобра - Плюющаяся кобра'),

(103673, 32233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Созерцатель Тьмы - Избегание'),
(103673, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Созерцатель Тьмы - Player Damage Reduction'),
(103673, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Созерцатель Тьмы - Снижение урона по игроку 90го уровня'),

(99737, 32233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дикий бес - Избегание'),
(99737, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дикий бес - Player Damage Reduction'),
(99737, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дикий бес - Снижение урона по игроку 90го уровня'),

(98035, 32233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дикий бес - Избегание'),
(98035, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дикий бес - Player Damage Reduction'),
(98035, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дикий бес - Снижение урона по игроку 90го уровня'),

(11859, 32233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Страж ужаса - Избегание'),
(11859, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Страж ужаса - Player Damage Reduction'),
(11859, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Страж ужаса - Снижение урона по игроку 90го уровня'),

(89, 19483, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Обжигающий жар'),
(89, 32233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Избегание'),
(89, 85686, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Summon Infernal Dummy'),
(89, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Player Damage Reduction'),
(89, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Снижение урона по игроку 90го уровня'),

(95061, 228355, 0, 0, 1, 0, 0, 0, 212636, 0, 0, 0, 'Большой элементаль огня - Символ дрожащего пламени'),
(95061, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль огня - Избежание'),
(95061, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль огня - Player Damage Reduction'),
(95061, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль огня - Снижение урона по игроку 90го уровня'),

(95072, 36213, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль земли'),
(95072, 228353, 0, 0, 1, 0, 0, 0, 212635, 0, 0, 0, 'Большой элементаль земли - Символ гальки'),
(95072, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль земли - Избежание'),
(95072, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль земли - Player Damage Reduction'),
(95072, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Большой элементаль земли - Снижение урона по игроку 90го уровня'),

(29264, 65220, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Избежание'),
(29264, 36747, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Копия появления дыма'),
(29264, 58867, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Прыжок духа'),
(29264, 58877, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Призрачная охота'),
(29264, 85686, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Summon Infernal Dummy'),
(29264, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Player Damage Reduction'),
(29264, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Дух волка - Снижение урона по игроку 90го уровня'),
(29264, 147908, 0, 0, 1, 0, 0, 0, 147783, 0, 0, 0, 'Дух волка - Raptor Transform'),

(108452, 32233, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Избегание'),
(108452, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Player Damage Reduction'),
(108452, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Инфернал - Снижение урона по игроку 90го уровня'),
(108452, 19483, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Повелитель пламени'),

(19668, 63623, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Избежание'),
(19668, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Player Damage Reduction'),
(19668, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Снижение урона по игроку 90го уровня'),
(19668, 28305, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Высасывание маны (Пассивная)'),
(19668, 34429, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Облик Тьмы'),
(19668, 57989, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Смерть исчадия Тьмы'),
(19668, 63619, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Исчадие Тьмы - Стелющаяся Тьма'),
(19668, 195178, 0, 0, 1, 0, 0, 0, 81749, 0, 0, 0, 'Исчадие Тьмы - Искупление вины (Пассивная)'),

(62982, 63623, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Избежание'),
(62982, 115043, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Player Damage Reduction'),
(62982, 142689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Снижение урона по игроку 90го уровня'),
(62982, 34429, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Облик Тьмы'),
(62982, 57989, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Смерть исчадия Тьмы'),
(62982, 63619, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Стелющаяся Тьма'),
(62982, 123050, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Подчиняющий разум - Высасывание маны (Пассивная)'),
(62982, 195178, 0, 0, 1, 0, 0, 0, 81749, 0, 0, 0, 'Подчиняющий разум - Искупление вины (Пассивная)');





















