replace INTO `access_requirement` (`mapId`, `difficulty`, `level_min`, `comment`) VALUES 
('1712', '14', '120', 'Анторус, Пылающий Трон'),
('1712', '15', '120', 'Анторус, Пылающий Трон'),
('1712', '16', '120', 'Анторус, Пылающий Трон'),
('1676', '14', '120', 'Гробница Саргераса'),
('1676', '15', '120', 'Гробница Саргераса'),
('1676', '16', '120', 'Гробница Саргераса'),
('1753', '2', '120', 'Престол Триумвирата'),
('1753', '8', '120', 'Престол Триумвирата'),
('1753', '23', '120', 'Престол Триумвирата');

replace INTO `access_requirement` (`mapId`, `difficulty`, `dungeonId`, `level_min`, `comment`) VALUES 
('1676', '17', '1494', '120', 'ГС:Врата ада'),
('1676', '17', '1495', '120', 'ГС:Залы Стенаний'),
('1676', '17', '1496', '120', 'ГС:Зал аватары'),
('1676', '17', '1497', '120', 'ГС:Падение Искусителя'),
('1712', '17', '1610', '120', 'Анторус:Прорыв Света'),
('1712', '17', '1611', '120', 'Анторус:Запретный спуск'),
('1712', '17', '1612', '120', 'Анторус:Погибель надежды'),
('1712', '17', '1613', '120', 'Анторус:Трон Пантеона');
