 -- [Items] = [ 142265, 104331, 141649, 89614, 141299, 129952, 133542, 37710, 23767, 108634, 104318, 108635, 108633, 122122, 108631, 108632, 116763, 97942, 54212, 132518, 104304, 104306, 104303, 104305, 246823, 151184, 150547, 45057, 44606, 88385, 98552, 116122, 133998, 116138, 117569, 141712, 138878, 131814, 119212, 119210, 130191, 153126, 21536 ]

DELETE FROM spell_script_names WHERE spell_id IN (229872,246293,246351,246289,228704,246290,246292,246823,61551,128018,127916,128058,170978,217668,176890,176888);
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES
('229872', 'spell_big_red_rays'),
('246293', 'spell_set_up_board'),
('246351', 'spell_hearthstation_horde'),
('246289', 'spell_hearthstation_alliance'),
('228704', 'spell_kaldorei_light_globe'),
('246290', 'spell_deck_o_matic'),
('246292', 'spell_improved_card_pack'),
('246823', 'spell_throw_sphere_catch'),
('61551', 'spell_item_toy_train_set_pulse'),
('128018', 'spell_searing_gaze_of_the_dook'),
('127916', 'spell_searing_gaze_of_the_dook_hit'),
('128058', 'spell_searing_gaze_of_the_dook_despawn'),
('170978', 'spell_item_last_deck_of_nemelex_nobeh'),
('217668', 'spell_request_the_master_call_on_you'),
('176890', 'spell_gen_winning_hand'),
('176888', 'spell_gen_hearthstone_board');

DELETE FROM spell_scene WHERE SceneScriptPackageID IN (1550,462,1521);
INSERT INTO `spell_scene` (`SceneScriptPackageID`, `MiscValue`, `PlaybackFlags`, `CustomDuration`, `ScriptName`, `comment`) VALUES
('1550', '1181', '16', '0', 'sceneTrigger_deathwing_simulator', 'Toy'),
('462', '198', '16', '0', '', 'Northern Barrens 5.3 - Spirit Drum - PRK'),
('1521', '1167', '16', '0', 'sceneTrigger_circuit_game', 'Circuit Game');

DELETE FROM spell_group WHERE id = 1304;
INSERT INTO `spell_group` (`id`, `spell_id`) VALUES
('1304', '170963'),
('1304', '170964'),
('1304', '170965'),
('1304', '170966'),
('1304', '170967'),
('1304', '170968'),
('1304', '170969'),
('1304', '170970'),
('1304', '170971'),
('1304', '170972');

DELETE FROM spell_group_stack_rules WHERE group_id = 1304;
INSERT INTO `spell_group_stack_rules` (`group_id`, `stack_rule`) VALUES
('1304', '1');

DELETE FROM spell_linked_spell WHERE spell_trigger = 170978;
INSERT INTO `spell_linked_spell` (`spell_trigger`, `spell_effect`, `type`, `caster`, `target`, `hastype`, `hastalent`, `hasparam`, `hastype2`, `hastalent2`, `hasparam2`, `chance`, `cooldown`, `duration`, `hitmask`, `removeMask`, `effectMask`, `targetCountType`, `targetCount`, `actiontype`, `group`, `param`, `randList`, `comment`) VALUES
('170978', '170963', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '170963 170964 170965 170966 170967 170968 170969 170970 170971 170972', 'Последняя колода Немелекса Ксобеха');

DELETE FROM spell_aura_trigger WHERE spell_id = 227953;
INSERT INTO `spell_aura_trigger` (`spell_id`, `spell_trigger`, `option`, `option2`, `target`, `caster`, `bp0`, `bp1`, `bp2`, `effectmask`, `hastype`, `hastalent`, `hasparam`, `hastype2`, `hastalent2`, `hasparam2`, `chance`, `slot`, `comment`) VALUES
('227953', '228136', '1', '0', '14', '0', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', '0', 'Рог Гьяллара');

DELETE FROM spell_dummy_trigger WHERE spell_id IN (227953,195633,195484);
INSERT INTO `spell_dummy_trigger` (`spell_id`, `spell_trigger`, `option`, `target`, `caster`, `targetaura`, `bp0`, `bp1`, `bp2`, `effectmask`, `handlemask`, `aura`, `group`, `comment`) VALUES
('227953', '228136', '5', '0', '0', '0', '0', '0', '0', '1', '8', '0', '0', 'Рог Гьяллара'),
('195633', '195634', '11', '0', '0', '0', '0', '0', '0', '1', '8', '0', '0', 'Сокровище с секретом'),
('195484', '195633', '11', '0', '0', '0', '0', '0', '0', '1', '8', '0', '0', 'Сокровище с секретом');

UPDATE creature_template SET `gossip_menu_id`='100001', `npcflag`='1', `unit_flags`='33536', unit_flags2 = 67141632, AIName="SmartAI" WHERE entry IN (73781);
UPDATE creature_template SET faction = 190, `unit_flags`='33536', unit_flags2 = 67141632 WHERE entry IN (73794,73793,73801,73795);
UPDATE `creature_template` SET `unit_flags`='131072', `unit_flags2`='2048', `unit_flags3`='1', `mechanic_immune_mask`='1071627199', `ScriptName`='npc_anatomical_dummy' WHERE (`entry`='66374');
UPDATE `creature_template` SET `InhabitType`='4' WHERE (`entry`='114846');
UPDATE `creature_template` SET `ScriptName`='npc_future_you' WHERE (`entry`='98942');
UPDATE `creature_template` SET `spell1`='193187', `spell2`='191282' WHERE (`entry`='76638');
UPDATE `creature_template` SET `spell1`='24933', `spell2`='193177', `spell3`='191282' WHERE (`entry`='76641');
UPDATE `creature_template` SET `spell1`='179900', `spell2`='179898', `spell3`='179899' WHERE (`entry`='90304');
UPDATE `creature_template` SET `spell1`='193187', `spell2`='191282' WHERE (`entry`='76637');
UPDATE `creature_template` SET `spell1`='191290', `spell2`='191288', `spell3`='191282' WHERE (`entry`='76640');
UPDATE `creature_template` SET `spell1`='191290', `spell2`='193169', `spell3`='191282' WHERE (`entry`='76642');
UPDATE `creature_template` SET `spell1`='171867', `spell2`='171874' WHERE (`entry`='86020');
UPDATE `creature_template` SET `spell1`='42382', `spell2`='42372', `spell3`='6533' WHERE (`entry`='17299');
UPDATE `creature_template` SET `spell1`='49297' WHERE (`entry`='27664');
UPDATE `creature_template` SET `spell1`='254400', `spell2`='254402', `AIName`='SmartAI' WHERE (`entry`='128236');
UPDATE `creature_template` SET `VehicleId`='224', `unit_flags`='33554432', `InhabitType`='4', `ScriptName`='npc_instant_statue_pedestal' WHERE (`entry`='40246');
UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='73743');
UPDATE creature_template SET AIName = "SmartAI" WHERE entry IN (73735,73737,73734,73736,15631);
UPDATE `creature_template_wdb` SET `Displayid1`='11686', `Displayid2`='0' WHERE entry IN (73735,73737,73734,73736);
UPDATE `gameobject_template` SET `ScriptName`="go_toy_train_set" WHERE `entry`=193963;
UPDATE `creature_template` SET `ScriptName`="npc_train_wrecker" WHERE `entry`=33404;
UPDATE `creature_template` SET `unit_flags`='33554432', `AIName`='SmartAI' WHERE (`entry`='71500');
UPDATE `creature_template` SET `unit_flags`='33554432', `ScriptName`='npc_infant_spider' WHERE (`entry`='56194');
UPDATE `creature_template` SET `SpellStateAnimKitID`='8189' WHERE (`entry`='99973');
UPDATE `creature_template` SET `unit_flags`='0', `AIName`='SmartAI' WHERE (`entry`='99478');
UPDATE `creature_template` SET `unit_flags`='0' WHERE (`entry`='65325');

DELETE FROM creature_template WHERE entry IN (123794,123793);
INSERT INTO `creature_template` (`entry`, `gossip_menu_id`, `minlevel`, `maxlevel`, `SandboxScalingID`, `ScaleLevelMin`, `ScaleLevelMax`, `ScaleLevelDelta`, `ScaleLevelDuration`, `exp`, `faction`, `npcflag`, `npcflag2`, `speed_walk`, `speed_run`, `speed_fly`, `scale`, `mindmg`, `maxdmg`, `dmgschool`, `attackpower`, `dmg_multiplier`, `baseattacktime`, `rangeattacktime`, `unit_class`, `unit_flags`, `unit_flags2`, `unit_flags3`, `dynamicflags`, `trainer_type`, `trainer_spell`, `trainer_class`, `trainer_race`, `minrangedmg`, `maxrangedmg`, `rangedattackpower`, `lootid`, `pickpocketloot`, `skinloot`, `resistance1`, `resistance2`, `resistance3`, `resistance4`, `resistance5`, `resistance6`, `spell1`, `spell2`, `spell3`, `spell4`, `spell5`, `spell6`, `spell7`, `spell8`, `PetSpellDataId`, `VehicleId`, `mingold`, `maxgold`, `AIName`, `MovementType`, `InhabitType`, `HoverHeight`, `Mana_mod_extra`, `Armor_mod`, `RegenHealth`, `mechanic_immune_mask`, `flags_extra`, `ControllerID`, `WorldEffects`, `PassiveSpells`, `StateWorldEffectID`, `SpellStateVisualID`, `SpellStateAnimID`, `SpellStateAnimKitID`, `IgnoreLos`, `AffixState`, `MaxVisible`, `ScriptName`) VALUES
('123794', '0', '1', '1', '0', '0', '0', '0', '0', '0', '190', '0', '0', '1', '1.14286', '1.14286', '1', '0', '0', '0', '0', '1', '0', '0', '1', '33536', '67141632', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5466', '0', '0', '', '0', '3', '1', '1', '1', '1', '0', '0', '0', '', '', '0', '0', '0', '0', '0', '0', '0', 'npc_hearthstation'),
('123793', '0', '1', '1', '0', '0', '0', '0', '0', '0', '190', '0', '0', '1', '1.14286', '1.14286', '1', '0', '0', '0', '0', '1', '0', '0', '1', '33536', '67141632', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5465', '0', '0', '', '0', '3', '1', '1', '1', '1', '0', '0', '0', '', '', '0', '0', '0', '0', '0', '0', '0', 'npc_hearthstation');

DELETE FROM npc_spellclick_spells WHERE npc_entry IN (123794,123793,65325);
INSERT INTO `npc_spellclick_spells` (`npc_entry`, `spell_id`, `cast_flags`, `user_type`, `add_npc_flag`) VALUES
('123794', '246308', '1', '0', '0'),
('123793', '246308', '1', '0', '0'),
('65325', '127832', '1', '0', '1');

DELETE FROM creature_template_addon WHERE entry IN (65325,99973);
INSERT INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `auras`) VALUES
('65325', '0', '0', '0', '0', '0', '127826 105459'),
('99973', '0', '0', '0', '0', '0', '188729');

DELETE FROM creature_text WHERE entry IN (66374,98942);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
('66374', '0', '0', 'Даже не $gпощекотал:пощекотала,!', '12', '0', '100', '0', '0', '0', '67531', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '1', 'И это все, что ты можешь?', '12', '0', '100', '0', '0', '0', '67530', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '2', 'Пытки – не твой конек.', '12', '0', '100', '0', '0', '0', '67532', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '3', 'О, как больно! Шутка!', '12', '0', '100', '0', '0', '0', '67519', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '4', 'Налетай!', '12', '0', '100', '0', '0', '0', '67521', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '5', 'Ай-я-яй! Огромный злой могу! У меня уже дрожат коленки!', '12', '0', '100', '0', '0', '0', '67520', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '6', 'И вот это должно было сделать мне больно?', '12', '0', '100', '0', '0', '0', '67533', '0', '0', '0', 'Анатомически точный манекен to Player'),
('66374', '0', '7', 'Хочешь кусок от меня?', '12', '0', '100', '0', '0', '0', '67522', '0', '0', '0', 'Анатомически точный манекен to Player'),
('98942', '0', '0', 'Пока, $n! Если у тебя получится летать на своем средстве передвижения с достаточной скоростью, ты сможешь навестить меня еще раз. Тебе нужно установить конденсатор молний Скверны (ИСК-лючительно нестабильный). Или что, его еще не изобрели?', '15', '0', '100', '0', '0', '0', '100581', '0', '0', '0', 'Despawn'),
('98942', '0', '1', 'Мне пора идти. И запомни самое главное...', '15', '0', '100', '0', '0', '0', '100573', '0', '0', '0', 'Despawn'),
('98942', '0', '2', 'И когда в следующий раз будешь в Альтеракской долине, что бы ты ни $gделал:делала,, ни в коем случае не щелкай по порталу!', '15', '0', '100', '0', '0', '0', '100572', '0', '0', '0', 'Despawn'),
('98942', '0', '3', 'Всякий раз, когда ты тратишь деньги на ремонт нашей экипировки, мне все труднее покупать невостребованный контейнер товаров для черного рынка. Береги себя!', '15', '0', '100', '0', '0', '0', '100569', '0', '0', '0', 'Despawn'),
('98942', '0', '4', 'Еще увидимся, $n! И не забывай, я – это ты в прошлом. Я и сейчас – это ты, но и в прошлом я – бывший ты.', '15', '0', '100', '0', '0', '0', '100570', '0', '0', '0', 'Despawn'),
('98942', '0', '5', 'Слушай. Я не должен тебе этого говорить, но эта вечеринка, куда и тебя пригласили... Что бы там ни происходило, НИ В КОЕМ СЛУЧАЕ НЕ ПЕЙ ПУНШ!', '15', '0', '100', '0', '0', '0', '27313', '0', '0', '0', 'Despawn'),
('98942', '0', '6', 'Пока, $n. Кстати, я тут подумал: а бронзовые драконы пользуются таймшером? Им должно быть непросто.', '15', '0', '100', '0', '0', '0', '100582', '0', '0', '0', 'Despawn'),
('98942', '0', '7', 'Давно не виделись, $n! Надеюсь, я попал в правильное время. Хроми объяснит, как все это работает, но мы все равно запутаемся.', '15', '0', '100', '0', '0', '0', '100577', '0', '0', '0', 'Despawn'),
('98942', '1', '0', 'Привет, $n. На этот раз никаких предупреждений. Просто хочу поздороваться.', '15', '0', '100', '0', '0', '0', '100561', '0', '0', '0', 'Greetings'),
('98942', '1', '1', 'Ого, $n, эта трансмогрификация – крутая штука! Наикрутейшая! Я бы хотел попробовать.', '15', '0', '100', '0', '0', '0', '100568', '0', '0', '0', 'Greetings'),
('98942', '1', '2', 'Хо-хо-хо! Я – дух будущего Зимнего Покрова! Все, кто в этом году делал успехи, получат в подарок питомца или доспехи!', '15', '0', '100', '0', '0', '0', '100579', '0', '0', '0', 'Greetings'),
('98942', '1', '3', '$n, почему ты еще не $gзачаровал:зачаровала, этот предмет? Мы еще не скоро найдем ему замену, уж поверь мне.', '15', '0', '100', '0', '0', '0', '100562', '0', '0', '0', 'Greetings'),
('98942', '1', '4', 'Как дела, $n? Впрочем, можешь не отвечать, я и так знаю. Знал. Думаю, и ты потом узнаешь, как у тебя были дела. Мы думаем. Ты $gдумал:думала,? С этими временами сплошная путаница.', '15', '0', '100', '0', '0', '0', '100584', '0', '0', '0', 'Greetings'),
('98942', '1', '5', 'Привет, $n! Ой, это то самое время, когда мы ходили в таверну и тебе была нужна помощь, чтобы смухлевать в Hearthstone? Стыдно, стыдно!', '15', '0', '100', '0', '0', '0', '100578', '0', '0', '0', 'Greetings'),
('98942', '1', '6', 'Эй, послушай-ка. Хочу предупредить тебя. Нас! Я в опасности. Вернее, мы в опасности. Я имею в виду... Я был в опасности, а теперь ты будешь в опасности. Чертовы путешествия во времени...', '15', '0', '100', '0', '0', '0', '100560', '0', '0', '0', 'Greetings'),
('98942', '2', '0', 'Это не мне нужно уйти, а тебе!', '15', '0', '100', '0', '0', '0', '100563', '0', '0', '0', 'Emote: Go'),
('98942', '3', '0', 'Никто не смеет мне указывать!', '15', '0', '100', '0', '0', '0', '100564', '0', '0', '0', 'Emote: Point'),
('98942', '2', '1', 'Я все равно собирался уходить.', '15', '0', '100', '0', '0', '0', '100566', '0', '0', '0', 'Emote: Go'),
('98942', '4', '0', 'Ты пожалеешь о своих словах!', '15', '0', '100', '0', '0', '0', '100559', '0', '0', '0', 'Emote: Rude');

DELETE FROM conditions WHERE SourceTypeOrReferenceId = 13 AND SourceEntry IN (194577,246809);
DELETE FROM conditions WHERE SourceTypeOrReferenceId = 17 AND SourceEntry = 246308;
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
('13', '1', '194577', '0', '0', '31', '0', '3', '98942', '0', '0', '0', '', 'to target'),
('13', '1', '246809', '0', '0', '31', '0', '4', '0', '0', '0', '0', '', 'to target'),
('17', '0', '246308', '0', '0', '1', '0', '246351', '0', '0', '1', '0', '', 'true if player non have aura'),
('17', '0', '246308', '0', '0', '1', '0', '246289', '0', '0', '1', '0', '', 'true if player non have aura');

DELETE FROM gossip_menu_option WHERE MenuID = 100001;
INSERT INTO `gossip_menu_option` (`MenuID`, `OptionIndex`, `OptionNPC`, `OptionText`, `OptionType`, `OptionNpcflag`, `OptionNpcflag2`, `ActionMenuID`, `ActionPoiID`, `BoxCoded`, `BoxMoney`, `BoxCurrency`, `BoxText`, `OptionBroadcastTextID`, `BoxBroadcastTextID`, `VerifiedBuild`) VALUES
('100001', '0', '0', 'Впереди город.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76758', '0', '0'),
('100001', '1', '0', 'Впереди опасность.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76759', '0', '0'),
('100001', '2', '0', 'Впереди сокровище.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76760', '0', '0'),
('100001', '3', '0', 'Впереди опасный противник.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76761', '0', '0'),
('100001', '4', '0', 'Впереди противоположная фракция.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76762', '0', '0'),
('100001', '5', '0', 'Секрет где-то рядом.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76763', '0', '0'),
('100001', '6', '0', 'Здесь!', '1', '1', '0', '0', '0', '0', '0', '0', '', '76764', '0', '0'),
('100001', '7', '0', 'Тупик.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76765', '0', '0'),
('100001', '8', '0', 'Смертельная ловушка.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76766', '0', '0'),
('100001', '9', '0', 'Орда близко.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76767', '0', '0'),
('100001', '10', '0', 'Альянс близко.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76768', '0', '0'),
('100001', '11', '0', 'Требуется танк.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76769', '0', '0'),
('100001', '12', '0', 'Требуется лекарь.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76770', '0', '0'),
('100001', '13', '0', 'Требуется боец.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76771', '0', '0'),
('100001', '14', '0', 'Требуется особый предмет.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76772', '0', '0'),
('100001', '15', '0', 'Требуется эпическое оружие.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76773', '0', '0'),
('100001', '16', '0', 'Нужны друзья.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76774', '0', '0'),
('100001', '17', '0', 'Редкое существо.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76775', '0', '0'),
('100001', '18', '0', 'Опасная пропасть.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76776', '0', '0'),
('100001', '19', '0', 'Слезы.', '1', '1', '0', '0', '0', '0', '0', '0', '', '76777', '0', '0');

DELETE FROM smart_scripts WHERE entryorguid IN (73781,71500,85589,8558900,8558901,99478,128236,15631);
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
('73781', '0', '0', '0', '62', '0', '100', '0', '100001', '0', '0', '0', '11', '148628', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '1', '0', '62', '0', '100', '0', '100001', '1', '0', '0', '11', '148629', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '2', '0', '62', '0', '100', '0', '100001', '2', '0', '0', '11', '148630', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '3', '0', '62', '0', '100', '0', '100001', '3', '0', '0', '11', '148631', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '4', '0', '62', '0', '100', '0', '100001', '4', '0', '0', '11', '148632', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '5', '0', '62', '0', '100', '0', '100001', '5', '0', '0', '11', '148633', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '6', '0', '62', '0', '100', '0', '100001', '6', '0', '0', '11', '148634', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '7', '0', '62', '0', '100', '0', '100001', '7', '0', '0', '11', '148635', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '8', '0', '62', '0', '100', '0', '100001', '8', '0', '0', '11', '148636', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '9', '0', '62', '0', '100', '0', '100001', '9', '0', '0', '11', '148637', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '10', '0', '62', '0', '100', '0', '100001', '10', '0', '0', '11', '148638', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '11', '0', '62', '0', '100', '0', '100001', '11', '0', '0', '11', '148639', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '12', '0', '62', '0', '100', '0', '100001', '12', '0', '0', '11', '148640', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '13', '0', '62', '0', '100', '0', '100001', '13', '0', '0', '11', '148641', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '14', '0', '62', '0', '100', '0', '100001', '14', '0', '0', '11', '148642', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '15', '0', '62', '0', '100', '0', '100001', '15', '0', '0', '11', '148643', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '16', '0', '62', '0', '100', '0', '100001', '16', '0', '0', '11', '148644', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '17', '0', '62', '0', '100', '0', '100001', '17', '0', '0', '11', '148645', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '18', '0', '62', '0', '100', '0', '100001', '18', '0', '0', '11', '148646', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '19', '0', '62', '0', '100', '0', '100001', '19', '0', '0', '11', '148647', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73781', '0', '20', '0', '54', '0', '100', '0', '0', '0', '0', '0', '207', '0', '0', '0', '0', '0', '0', '23', '0', '0', '0', '0', '0', '0', '0', 'pers vis'),
('71500', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '29', '0', '0', '0', '0', '0', '0', '23', '0', '0', '0', '0', '0', '0', '0', 'follow'),
('85589', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '88', '8558900', '8558901', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'Burning Legion Missive'),
('8558900', '9', '0', '0', '0', '0', '100', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'Burning Legion Missive'),
('8558900', '9', '1', '0', '0', '0', '100', '0', '5000', '5000', '0', '0', '1', '1', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'Burning Legion Missive'),
('8558901', '9', '0', '0', '0', '0', '100', '0', '0', '0', '0', '0', '1', '2', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'Burning Legion Missive'),
('8558901', '9', '1', '0', '0', '0', '100', '0', '5000', '5000', '0', '0', '1', '3', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'Burning Legion Missive'),
('99478', '0', '0', '0', '73', '0', '100', '0', '0', '0', '0', '0', '128', '8189', '1', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'play animkit'),
('99478', '0', '1', '0', '73', '0', '100', '0', '0', '0', '0', '0', '83', '16777216', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'remove npc flag'),
('99478', '0', '2', '0', '73', '0', '100', '0', '0', '0', '0', '0', '41', '10000', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'despawn'),
('128236', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '3', '0', '79844', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'set morph'),
('15631', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '11', '25824', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell');

DELETE FROM conditions WHERE SourceTypeOrReferenceId = 13 AND SourceEntry IN (148581,24933,193188,193168,179898,179901,191289,191288,171867,171875,254399);
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
('13', '1', '148581', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '148581', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '193188', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '24933', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '193168', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '179898', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '179901', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '191289', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '191288', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '171867', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '171875', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '0', '31', '0', '3', '76640', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '1', '31', '0', '3', '27664', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '2', '31', '0', '3', '73743', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '3', '31', '0', '3', '76641', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '4', '31', '0', '3', '76642', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '5', '31', '0', '3', '17299', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '6', '31', '0', '3', '76638', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '7', '31', '0', '3', '86020', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '8', '31', '0', '3', '40281', '0', '0', '0', '', 'to target'),
('13', '1', '254399', '0', '9', '31', '0', '3', '128236', '0', '0', '0', '', 'to target');

DELETE FROM spell_target_filter WHERE spellId IN (148581,24933,193188,193168,179898,179901,191289,191288,171867,171875,254399);
INSERT INTO `spell_target_filter` (`spellId`, `index`, `targetId`, `option`, `param1`, `param2`, `param3`, `aura`, `chance`, `effectMask`, `resizeType`, `count`, `maxcount`, `addcount`, `addcaster`, `comments`) VALUES
('148581', '0', '60', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Ракетный залп'),
('24933', '0', '60', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Пушка'),
('193188', '0', '7', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Турбо-рывок'),
('193188', '0', '22', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Турбо-рывок'),
('193168', '0', '8', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Мортира'),
('179898', '0', '110', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Струя огня'),
('179901', '0', '8', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Мортира'),
('191289', '0', '8', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Огненный миномет'),
('191288', '0', '110', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Огненное запал'),
('171867', '0', '60', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Дисковая пила'),
('171875', '0', '22', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Серво-прыжок'),
('171875', '0', '7', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Серво-прыжок'),
('254399', '0', '8', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '-1', 'Мортира');

DELETE FROM spell_linked_spell WHERE spell_trigger IN (74890,-75731,-75055,-74890);
INSERT INTO `spell_linked_spell` (`spell_trigger`, `spell_effect`, `type`, `caster`, `target`, `hastype`, `hastalent`, `hasparam`, `hastype2`, `hastalent2`, `hasparam2`, `chance`, `cooldown`, `duration`, `hitmask`, `removeMask`, `effectMask`, `targetCountType`, `targetCount`, `actiontype`, `group`, `param`, `randList`, `comment`) VALUES
('74890', '75055', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя'),
('-75731', '-75055', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя'),
('-75731', '-74890', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя'),
('-75055', '-75731', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя'),
('-75055', '-74890', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя'),
('-74890', '-75731', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя'),
('-74890', '-75055', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', '0', '', 'Мгновенно возводимая статуя');

DELETE FROM smart_scripts WHERE entryorguid IN (73735,73737,73734,73736);
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
('73735', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '11', '148544', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73737', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '11', '148546', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73734', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '11', '148543', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell'),
('73736', '0', '0', '0', '54', '0', '100', '0', '0', '0', '0', '0', '11', '148545', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'cast spell');

DELETE FROM areatrigger_actions WHERE entry IN (1332,1329,1330,1331);
INSERT INTO `areatrigger_actions` (`entry`, `customEntry`, `id`, `moment`, `actionType`, `targetFlags`, `spellId`, `maxCharges`, `hasAura`, `hasAura2`, `hasAura3`, `hasspell`, `chargeRecoveryTime`, `scaleStep`, `scaleMin`, `scaleMax`, `scaleVisualUpdate`, `hitMaxCount`, `amount`, `onDespawn`, `auraCaster`, `minDistance`, `comment`) VALUES
('1332', '0', '0', '1', '0', '8', '148541', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Закат'),
('1332', '0', '1', '2', '1', '8', '148541', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Закат'),
('1329', '0', '0', '1', '0', '8', '148539', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Ураганный ливень'),
('1329', '0', '1', '2', '1', '8', '148539', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Ураганный ливень'),
('1330', '0', '0', '1', '0', '8', '148540', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Снежная буря'),
('1330', '0', '1', '2', '1', '8', '148540', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Снежная буря'),
('1331', '0', '0', '1', '0', '8', '148542', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Пепельная буря'),
('1331', '0', '1', '2', '1', '8', '148542', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', 'Пепельная буря');